/* все ответы */
const option1 = document.querySelector('.option1');
const option2 = document.querySelector('.option2');
const option3 = document.querySelector('.option3');
const option4 = document.querySelector('.option4');
const option5 = document.querySelector('.option5');

/* все вопросы */
const optionElements = document.querySelectorAll('.option');

const question = document.getElementById('question'),
      numberOfQuestion = document.getElementById('number-of-question'),
      numberOfAllQuestion = document.getElementById('number-of-all-questions');

let indexOfQuestion, // индекс текущего вопроса
    indexOfPage = 0; // индекс страниц

const answersTracker = document.getElementById('answers-tracker');
const btnNext = document.getElementById('btn-next');

let score = 0; // Итоговый Результат

const correctAnswer = document.getElementById('correct-answer'),
      numberOfAllQuestion2 = document.getElementById('number-of-all-questions-2'),
      btnTryAgain = document.getElementById('btn-try-again');

const questions = [
    {
        question: 'Оқшау сөздер кездескенде, сөйлемде қандай тыныс белгісі қойылады?',
        options: [
            'тырнақша',
            'үтір',
            'нүктелі үтір',
            'қос нүкте',
            'нүкте',
        ],
        rightAnswer: 1
    },
    {
        question: 'Жіңішке дауысты сөзді табыңыз.',
        options: [
            'Қора',
            'Қауырсын',
            'Сауысқан',
            'Кілем',
            'Базар',
        ],
        rightAnswer: 3
    },
    {
        question: 'Бірыңғай мүшелерді байланыстыратын ыңғайластық жалғаулық шылаулар кайсы?',
        options: [
            'менен, бірақ, алайда',
            'бен, я, яки',
            'ма, ме, ше',
            'та, не, немесе',
            'және, мен, әрі',
        ],
        rightAnswer: 1
    },
    {
        question: 'Тек ашық буыннан құралған сөзді табыңыз.',
        options: [
            'Алтай',
            'Өзге',
            'Шағала',
            'Қарағай',
            'Ойбай',
        ],
        rightAnswer: 2
    },
    {
        question: '«Бірде, біресе» шылауларымен жасалатын сөйлемнің түрін анықтаңыз.',
        options: [
            'Кезектес салалас құрмалас',
            'Себеп-салдар салалас құрмалас',
            'Ыңғайлас салалас құрмалас',
            'Түсіндірмелі салалас құрмалас',
            'Қарсылықты салалас құрмалас',
        ],
        rightAnswer: 0
    },
    {
        question: 'Қай дауысты дыбыс әрі жуан, әрі жіңішке дауыстыға жататынын анықтаңыз.',
        options: [
            'о',
            'и',
            'а',
            'е',
            'ү',
        ],
        rightAnswer: 1
    },
    {
        question: 'Төл сөзге байланысты тыныс белгілері дұрыс қойылған сөйлемді аңықтаңыз:',
        options: [
            'Мұғалім «Балалар, бақылау жұмысын жақсы орындадыңдар», -деді.',
            'Мұғалім - Балалар, бақылау жұмысын жақсы орындадыңдар, -деді.',
            'Мұғалім: Балалар, бақылау жұмысын жақсы орындадыңдар,-деді.',
            'Мұғалім - «Балалар, бақылау жұмысын жақсы орындадыңдар», -деді',
            'Мұғалім: «Балалар, бақылау жұмысын жақсы орындадыңдар», -деді.',
        ],
        rightAnswer: 4
    },
    {
        question: '«Программное обеспечение» сөзі орыс тілінен қазақ тіліне қалай аударылады?',
        options: [
            'бағдарлама',
            'архитектура',
            'бағдарламалық қамсыздандыру',
            'ақпарат',
            'аппараттық қамсыздандыру',
        ],
        rightAnswer: 2
    },
    {
        question: '«Қой аузынан шөп алмас» фразиологизмі қандай мінезді білдіретінін табыңыз.',
        options: [
            'Жалқау',
            'Момын',
            'Тентек',
            'Қатал',
            'Сараң',
        ],
        rightAnswer: 1
    },
    {
        question: 'Бірыңғай мүшелердің анықтамасын табыңыз.',
        options: [
            'әр түрлі сұраққа жауап беретін сөйлем мүшелері',
            'дыбысталуы бірдей сөйлем мүшелері',
            'синтаксистік қызметі бірдей, өзара тұлғалас сөйлем мүшелері',
            'тұлғасы әр түрлі сөйлем мүшелері',
            'әр сөз табына жататын сөйлем мүшелері',
        ],
        rightAnswer: 2
    },
    {
        question: 'Қарсылықты салалас құрмалас сөйлемнің жалғаулықтарын табыңыздар',
        options: [
            'Және, әрі, да, де',
            'Өйткені, сондықтан, себебі',
            'Бірақ, дегенмен, алайда',
            'Бірде, біресе',
            'Не, немесе, яғни',
        ],
        rightAnswer: 2
    },
    {
        question: 'Қаратпа сөз белгілі бір сөйлем мүшесінің қызметін атқарады ма?',
        options: [
            'толықтауыш қызметін атқарады',
            'сөйлем мүшесінің қызметін атқармайды',
            'баяндауыш қызметін атқармайды',
            'пысықтауыш қызметін атқарады',
            'бастауыш қызметін атқарады',
        ],
        rightAnswer: 1
    },
    {
        question: 'Сөздің басында жазылмайтын әріпті көрсетіңіз.',
        options: [
            'ә',
            'қ',
            'ғ',
            'ы',
            'ң',
        ],
        rightAnswer: 4
    },
    {
        question: '«Бағдарламалау» сөзі қазақ тілінен орыс тіліне қалай аударылады?',
        options: [
            'проектирование',
            'программирование',
            'программа',
            'алгоритмизация',
            'накопитель',
        ],
        rightAnswer: 1
    },
    {
        question: 'Сөйлемнің түрін анықтаңыз.' + '</br>' + 'Ол сабаққа дайындалмаған себебі: кеше кітапханадан кітап таба алмады.',
        options: [
            'Түсіндірмелі салалас құрмалас',
            'Ыңғайлас салалас құрмалас',
            'Кезектес салалас құрмалас',
            'Талғаулы салалас құрмалас',
            'Қарсылықты салалас құрмалас',
        ],
        rightAnswer: 0
    },
    {
        question: 'Үндестік заңына бағынбайтын сөзді табыңыз.',
        options: [
            'Жарыс',
            'Арман',
            'Жүйрік',
            'Атақты',
            'Жеңімпаз',
        ],
        rightAnswer: 4
    },
    {
        question: 'Буын үндестігіне бағынбай тұрған біріккен сөздерді табыңыз.',
        options: [
            'Халықаралық, өнеркәсіп',
            'Ақсуат, Сарысу',
            'Көкшетау, Екібастұз',
            'Бірсігүні, ендігәрі',
            'Сарыарқа, Талдықорған',
        ],
        rightAnswer: 2
    },
    {
        question: 'Өткен шақтағы етістікті табыңыз.',
        options: [
            'Ақша',
            'Бітірді',
            'Келе жатыр',
            'Ақшыл',
            'Көрмеу',
        ],
        rightAnswer: 1
    },
    {
        question: 'Үстеу қандай сөз табы.',
        options: [
            'Заттардың қимыл- әрекетін білдіретін сөз табы',
            'Заттың сындық белгісін білдіретін сөз табы',
            'Есім сөздердің орнына жұмсалатын сөз табы',
            'Қимылдың жайы – күйін, әр түрлі белгілерін сипаттайтын сөз табы ',
            'Заттың сандық белгісін білдіретін сөз табы',
        ],
        rightAnswer: 3
    },
    {
        question: 'Қыстырма сөзді табыңыз.',
        options: [
            'Сірә',
            'Қызыл',
            'Жеті',
            'Балам',
            'Ей',
        ],
        rightAnswer: 0
    },
    {
        question: 'Контексті менюді қалай шақыруға болады?  ',
        options: [
            'Windows-та мынадай менюдің түрі жоқ',
            'Тышқанныңың оң жақ батырмасын шертіп',
            'Керекті объектіге курсорды қойып тышқанның сол жақ пернесін басып',
            'Керекті объект активті болғанда ALT пернені басып',
            'Объектті қос шерту',
        ],
        rightAnswer: 1
    },
    {
        question: 'Word-тағы кестенің басқа ұяшығына ауысу үшін не істеу керек?',
        options: [
            'Esc пернесін басу',
            'End пернесін басу',
            'Enter пернесін басу',
            'Тышқанды басқару пернелерін пайдалану',
            'Home пернесін басу',
        ],
        rightAnswer: 3
    },
    {
        question: 'Жедел жад не үшін арналған?',
        options: [
            'Дұрыс жауап жоқ',
            'Берілген уақыт мезгілінде бір программаны өндеуге',
            'Информацияны сақтауға',
            'Информацияны өндеуге',
            'Программаларды іске қосуға',
        ],
        rightAnswer: 1
    },
    {
        question: 'Windows деген не?',
        options: [
            'Программалау тілі',
            'Қолданба',
            'Операциялық жүйе',
            'Қолданбалы программа',
            'Құрамдас енгізу-шығару жүйе',
        ],
        rightAnswer: 2
    },
    {
        question: 'Кез-келген Windows-терезенің оң жақ жоғары бұрышында орналасқан батырма не үшін керек?',
        options: [
            'Терезені жабу үшін',
            'Жұмыс орны бойынша терезені жылжыту үшін',
            'Терезені жыймалау үшін',
            'Терезенің өлшемдерін қалпына келтіру үшін',
            'Барлық экранға терезені жазу үшін',
        ],
        rightAnswer: 0
    },
    {
        question: 'Курсордың жолдың аяғына тез ауысуын қандай перне орындайды?',
        options: [
            'Esc',
            'End',
            'Shift',
            'Insert',
            'Ctrl',
        ],
        rightAnswer: 1
    },
    {
        question: 'Excel-де деректерді графикалық түрде көрсету үшін не қолданылады?',
        options: [
            'Суреттер шебері',
            'Формулалар шебері',
            '"Рисование" құрал-саймандар тақтасы',
            'Құрама кестелер шебері',
            'Диаграммалар шебері',
        ],
        rightAnswer: 4
    },
    {
        question: 'Қашықтан компьютерлердегі сақталатын деректер нені жасайды?',
        options: [
            'Интернетті',
            'Аппараттық ресурстарды',
            'Информациялық ресурстарды',
            'Желіні',
            'Хаттаманы',
        ],
        rightAnswer: 2
    },
    {
        question: 'Төменгі жақта берілген мәтінде тізімнің қандай типі пайдаланған? 1. қазақ 2. орыс 3. татар 4. украин ',
        options: [
            '1-ші тізім',
            'Нөмірленген тізім',
            'Көп деңгейлі тізім',
            'Таңбаланған тізім',
            'Автоматтанған тізім берілген үзіндіде пайдалынбайды',
        ],
        rightAnswer: 1
    },
    {
        question: 'Бас менюдің "Поиск" пунктісі не үшін қолданылады?',
        options: [
            'соңғы 15 құжаттар тізімін шығару',
            'программаларды тез іске қосу',
            'файлдар мен бумаларды іздеу',
            'жүйе құрауышыларын баптау',
            'компьютерді тұрақтату',
        ],
        rightAnswer: 2
    },
    {
        question: 'Функционалды пернелер деп қандай пернелерді айтамыз?',
        options: [
            'CapsLock, NumLock',
            'Alt, Shift, Enter',
            'F1..F12',
            'Home, Delete, PageDown',
            'Дұрыс жауап жоқ',
        ],
        rightAnswer: 2
    },
    {
        question: 'Жойылған объектілер уақытша түсетін қапшықты қалай атайды?',
        options: [
            'Блокнот',
            '"Қоржын"',
            'Опретивтік қапшық',
            'Дұрыс жауап жоқ',
            'Бума',
        ],
        rightAnswer: 1
    },
    {
        question: 'Windows программасы программалық жасаудың қандай типіне жатады?',
        options: [
            'Драйверлер',
            'Құрамдас енгізу-шығару жүйесі',
            'Стандартты қолданбалар',
            'Қолданбалы программалар',
            'Операциялық жүйелер',
        ],
        rightAnswer: 4
    },
    {
        question: 'Туынды түбірді анықтаңыз.',
        options: [
            'Жаңа',
            'Тазалық',
            'Сынып',
            'Жол',
            'Бол',
        ],
        rightAnswer: 1
    },
    {
        question: 'Синоним сөздерді табыңыз.',
        options: [
            'Әдемі, сұлу',
            'Бас, аяқ.',
            'Үлкен, кіші.',
            'Бас, жақ.',
            'Мұғалім, оқушы.',
        ],
        rightAnswer: 0
    },
    {
        question: 'Файл аты айқын объекті идентификациялауға мүмкіндік береді, ал кеңейтілуі нені сипаттайды?',
        options: [
            'Жасау уақытын',
            'Жолын',
            'Өлшемін',
            'Каталогын',
            'Типін',
        ],
        rightAnswer: 4
    },
    {
        question: 'Сұрау есімдіктерін көрсетіңіз.',
        options: [
            'Ешкім, ештеңе',
            'Анау, мынау.',
            'Кім, не.',
            'Олар, сендер.',
            'Ешқашан, ешбір',
        ],
        rightAnswer: 2
    },
    {
        question: 'Қазақстан Республикасының Мемлекеттік Туының авторын анықтаңыз.',
        options: [
            'Мұзафар Әлімбаев.',
            'Шәкен Ниязбеков',
            'Жандарбек Мәлібекұлы.',
            'Қадыр Мырза - Әлі',
            'Шотаман Уәлиханов.',
        ],
        rightAnswer: 1
    },
    {
        question: '"Мой компьютер" таңбашасы не үшін қажет?',
        options: [
            'Жойылған файлдармен бумалардыды сақтау үшін',
            'Windows қолданбалы программаларын іске қосу үшін',
            'Жергілікті желін баптау үшін',
            'Компьютер дискінің мазмұнын шартты түрде көрсететін бұтақты сақтау үшін',
            'Файл және бумаларар қасиеттерін қарап шығу үшін',
        ],
        rightAnswer: 3
    },
    {
        question: 'Тәуелденген сын есімді табыңыз.',
        options: [
            'Сенің балаң.',
            'Жақсың қайсы?',
            'Ешкімің жоқ.',
            'Біреуің кел.',
            'Айтарың бар ма?',
        ],
        rightAnswer: 0
    },
    {
        question: 'Тұйық етістікті анықтаңыз.',
        options: [
            'Айтыс',
            'Ұнау',
            'Қу',
            'Көрсет',
            'Жу',
        ],
        rightAnswer: 1
    },
    {
        question: '«Деректер қоры» сөзі қазақ тілінен орыс тіліне қалай аударылады?',
        options: [
            'алгоритм',
            'накопитель',
            'проек',
            'база данных',
            'программа',
        ],
        rightAnswer: 3
    },
    {
        question: 'Күрделі сын есімді табыңыз',
        options: [
            'Таза',
            'Орта бойлы',
            'Шыдамды',
            'Ұзақ',
            'Тұнық',
        ],
        rightAnswer: 1
    },
    {
        question: 'Түсіндірмелі салалас құрмалас сөйлемнің жасалу жолын көрсетіңіз.',
        options: [
            'Жалғаулықсыз',
            'Сөйткенмен',
            'Сондықтан',
            'Бірде',
            'Немесе',
        ],
        rightAnswer: 2
    },
    {
        question: '«Желсіз түнде жарық ай» қай ақынның өлеңі?',
        options: [
            'Абай Құнанбайұлы',
            'Қасым Аманжолов',
            'Иса Байзақов',
            'Мұқағали Мақатаев',
            'Шәкәрім Құдайбердиев',
        ],
        rightAnswer: 0
    },
    {
        question: 'Синонимдік қатар құрайтын зат есімді табыңыз.',
        options: [
            'Ем,дәрі',
            'Әдемі, сұлу',
            'Жоғары, төмен',
            'Суретші, сурет',
            'Дәстүр, салт',
        ],
        rightAnswer: 1
    },
    {
        question: 'Сөйлемнің ортасында келген қыстырма сөзді табыңыз.',
        options: [
            'Бүгін күн ашық екен, әй',
            'Біріншіден, Асқардың жасы кіші',
            'Қысқасы, сен үйде отырасың',
            'Әлбетте, сенікі дұрыс',
            'Мен, сірә, киноға бармайтын шығармын',
        ],
        rightAnswer: 4
    },
    {
        question: 'Құрмалас сөйлем түрлерін анықтаңыз.',
        options: [
            'Хабарлы, сұраулы.',
            'Жақты , жақсыз.',
            'Салалас, сабақтас, аралас.',
            'Жалаң, жайылма.',
            'Толымды, толымсыз.',
        ],
        rightAnswer: 2
    },
    {
        question: 'Топтау сан есімді көрсетіңіз.',
        options: [
            'Әркім',
            'Үш- үштен',
            'Туып- өскен',
            'Бәйтерек',
            'Әйгілі',
        ],
        rightAnswer: 1
    },
    {
        question: 'Болымды етістікті табыңыз.',
        options: [
            'Ұшпады',
            'Жумады',
            'Сүртті',
            'Әкелмеді',
            'Көрсетпеді',
        ],
        rightAnswer: 2
    },
    {
        question: 'Негізгі етістікті табыңыз.',
        options: [
            'Салынды',
            'Әперді',
            'Көр',
            'Ашуланды',
            'Берер',
        ],
        rightAnswer: 2
    },
    {
        question: 'Өздік есімдігін табыңыз.',
        options: [
            'Өркендету',
            'Өздеріңіз',
            'Мүлдем',
            'Көңілсіз',
            'Көрсеткіз',
        ],
        rightAnswer: 1
    },
    {
        question: 'Қыстырма сөзді табыңыз.',
        options: [
            'Ата, немереңіз келді.',
            'Өзің бір қызық жан екенсің.',
            'Алдымнан жақсы кездестің – ау, шырағым.',
            'Жолдас командир, жолдас комиссар.',
            'Қорыта келгенде, баяндама толық жасалған.',
        ],
        rightAnswer: 4
    },
    {
        question: 'Себеп-салдар салаластың шылауын табыңыз.',
        options: [
            'бірақ, дегенмен',
            'өйткені, себебі',
            'және, әрі',
            'не, немесе',
            'бірде, біресе',
        ],
        rightAnswer: 1
    },
    {
        question: 'Бірыңғай мүшелерді байланыстыру үшін қандай жалғаулық шылау қолдану керек?' + '</br>' + 'Ол...биік,…аласа,…қатал,…жұмсақ,..мінезді,…шешен,…сараң сөзді еді.',
        options: [
            'бірде ',
            'немесе',
            'да',
            'бірақ',
            'және',
        ],
        rightAnswer: 0
    },
    {
        question: 'Оқшау сөзді көрсетіңіз.',
        options: [
            'шылау',
            'үстеу',
            'жалғаулық',
            'шырай',
            'қыстырма',
        ],
        rightAnswer: 4
    },
    {
        question: 'Қатаң дауыссыз дыбыстарды көрсетіңіз.',
        options: [
            'н, р, у',
            'д, ж, з, һ',
            'қ, к, п, с',
            'й, л, м',
            'б, в, г, ғ',
        ],
        rightAnswer: 2
    },
    {
        question: '«Бірақ, дегенмен» шылауларымен жасалатын сөйлемнің түрін анықтаңыз.',
        options: [
            'Түсіндірмелі салалас құрмалас',
            'Қарсылықты салалас құрмалас',
            'Кезектес салалас құрмалас',
            'Себеп-салдар салалас құрмалас',
            'Ыңғайлас салалас құрмалас',
        ],
        rightAnswer: 1
    },
    {
        question: 'Түсіндірмелі салалас құрмалас сөйлем жалғаулықтарын анықтаңыз.',
        options: [
            'Сөйтсе де, әйтсе де',
            'Әйтпесе, немесе',
            'Жалғаулығы жоқ',
            'Өйткені, себебі',
            'Сол үшін, себебі',
        ],
        rightAnswer: 3
    },
    {
        question: 'Дауысты дыбыстардың еріннің қатысына қарай жіктелетін түрлерін көрсетіңіз.',
        options: [
            'еріндік, езулік',
            'қатаң, ұяң',
            'үнді, ұяң',
            'жуан, жіңішке',
            'қысаң, ашық',
        ],
        rightAnswer: 0
    },
    {
        question: '«Бала» сезіне қосылатын қосымшаны анықтаңыз.',
        options: [
            '- шы.',
            '- лық',
            '- ші.',
            '- тың.',
            '- лік.',
        ],
        rightAnswer: 1
    },
    {
        question: '«Қоян жүрек» фразеологизмінің антонимін табыңыз.',
        options: [
            'Батыр.',
            'Күшті.',
            'Әлсіз.',
            'Қорқақ.',
            'Салмақты.',
        ],
        rightAnswer: 3
    },
    {
        question: 'Туынды зат есімді анықтаңыз.',
        options: [
            'Ғалым.',
            'Оқытушы.',
            'Ел.',
            'Қыз.',
            'Жол.',
        ],
        rightAnswer: 1
    },
    {
        question: 'Төл сөзді сөйлемді белгілеңіз.',
        options: [
            'Сен дегенде сөз бар ма?',
            'Әй дер әже, қой дер қожа жоқ.',
            '"Келешек - өткен тарихты қорғау", - дейді Олжас Сүлейменов.',
            'Сауатты болу дегеніміз - дұрыс жазып, дұрыс сөйлеу.',
            'Балалардың соңғы ермегі -"Ақсүйек", "Соқыр теке".',
        ],
        rightAnswer: 2
    },
    {
        question: 'Программа дегеніміз… .',
        options: [
            'аппараттық құралдарды басқару үшін арналған командалардың реттелген тізбегі',
            'дұрыс жауап жоқ',
            'тізбекті интерфейстер құрылғысы',
            'жасалған құрылғылардың басқа құрылғылармен жұмысын келістіруге арналған техникалық жағдайлар жиынтығы',
            'есептеуіш жүйенің программалық жасау құрамы',
        ],
        rightAnswer: 0
    },
    {
        question: 'Ms Power Point программасының негізгі объектісі?',
        options: [
            'макрос',
            'слайд ',
            'терезе',
            'диаграмма',
            'кесте',
        ],
        rightAnswer: 1
    },
    {
        question: 'Белгілі бір атпен аталған дискідегі біртекті мәліметтер жиыны қалай аталады?',
        options: [
            'Деректер',
            'Информация',
            'Бума',
            'Каталог',
            'файл',
        ],
        rightAnswer: 4
    },
    {
        question: 'Курсордың жолдың басына тез ауысуын қандай перне орындайды?',
        options: [
            'Ctrl',
            'Esc',
            'Home',
            'Insert',
            'Shift',
        ],
        rightAnswer: 2
    },
    {
        question: 'Енгізу-шығару порты не үшін қолданылады?',
        options: [
            'Деректерді Интернетке шығару үшін',
            'Компьютерді сыртқы құрылғылармен байланыстыру үшін',
            'Деректреді ЭЕМ-ң оперативтік жадында сақтау үшін',
            'Жаңа программалық дестесімен жұмыс істеу үшін',
            'Деректерді модификациялау үшін',
        ],
        rightAnswer: 1
    },
    {
        question: 'Word программасы не үшін керек? ',
        options: [
            'Деректер базасымен жұмыс істеу үшін',
            'Жүйелік баптауларды атқару үшін',
            'Мәтін құжаттарын электронды түрде жасау және өңдеу үшін',
            'Компьютердің файлдық жүйесі бойынша іздеу',
            'Кестелік деректермен жұмыс істеу үшін, құрама деректер кестелерін жасау үшін',
        ],
        rightAnswer: 2
    },
    {
        question: 'Ұяң дауыссыздан басталған қосымшаны табыңыз.',
        options: [
            'Доптың.',
            'Терезелер.',
            'Қызға.',
            'Жастығымыз.',
            'Баласыңдар.',
        ],
        rightAnswer: 2
    },
    {
        question: 'Excel формуласында пайдаланатын, формуланы басқа орынға көшірген кезде өзгермейтін, ұяшыққа сілтеме қалай деп аталады?',
        options: [
            'ұяшыққа салыстырмалы сілтеме',
            'ұяшыққа абсолют сілтеме',
            'ұяшыққа аралас сілтеме',
            'автоауыстыру',
            'автоқосындылау',
        ],
        rightAnswer: 1
    },
    {
        question: 'Зергерлік бұйымдарды белгілеңіз.',
        options: [
            'Кітап, дәптер, қалам.',
            'Қару - жарақ, ер - тұрман, қоржын.',
            'Алаша, көрпе, төсеніш.',
            'Кесе, қасық, пышақ.',
            'Шолпы, білезік, сырға, қапсырма.',
        ],
        rightAnswer: 4
    },
    {
        question: 'Екілік кодпен барлық математикалық операцияларды қандай құрылғы жасайды?',
        options: [
            'Тышқан',
            'Орталық процессор',
            'CD-ROM',
            'Қатты диск',
            'Монитор',
        ],
        rightAnswer: 1
    },
    {
        question: '"Пуск" батырманы шерткен кезде пайда болатын меню қалай аталады?',
        options: [
            'Бас меню',
            'Программаны іске қосу меню',
            'Контекстті меню ',
            'Анықтаманы алу меню',
            'Пайдаланушының меню',
        ],
        rightAnswer: 0
    },
    {
        question: 'Баяндауышты табыңыз. Күзде жыл құстары жылы жаққа ұшып кетеді.',
        options: [
            'Жылы.',
            'Жакқа.',
            'Күзде.',
            'Жыл құстары.',
            'Ұшып кетеді.',
        ],
        rightAnswer: 4
    },
    {
        question: 'Пайдаланушы интерфейсі деген не?',
        options: [
            'Адамның аппараттық құрылғылармен өзара әрекеттесу әдістері мен құралдары',
            'Windows терезелерінің сыртқы түрі ',
            'Адамның аппараттық және программалық құрылғылармен өзара әрекеттесу әдістері мен құралдары',
            'Есептеуіш техниканың құралдарын аппараттық қамтамасуы',
            'Адамның программалық құрылғылармен өзара әрекеттесу әдістері мен құралдары',
        ],
        rightAnswer: 2
    },
    {
        question: 'Реттік сан есім нені білдіретінін көрсетіңіз.',
        options: [
            'Заттың дәл нақты санын білдіреді.',
            'Заттың реттік санын білдіреді',
            'Заттың санын жинақтап көрсетеді.',
            'Заттың санын топтап көрсетеді.',
            'Заттың санын бөлшектеп көрсетеді.',
        ],
        rightAnswer: 1
    },
    {
        question: 'Word-тағы айналдыру жолағы не үшін керек?',
        options: [
            'Колонтитулдарды жасау үшін',
            'Құжат бетінің бейнелеп көрсету масштабын өзгерту үшін',
            'Құрал-сайман панелін айналдыру үшін ',
            'Терезеге кірмейтін құжаттың мазмұнын қарау үшін',
            'Құжатты алдын ала қарап шығу үшін',
        ],
        rightAnswer: 3
    },
    {
        question: 'Бірнеше терезе бір мезгілде ашық бола ала ма?',
        options: [
            'Иә',
            'Иә, егер олардың барлығы ерекшеленген',
            'Иә, бірақ 5-тен артық емес',
            'Иә, егер олардың тақырыптары бір мезгілде жарық түспен ерекшеленген',
            'Жоқ',
        ],
        rightAnswer: 0
    },
    {
        question: 'Себеп-салдар салаластың шылауын табыңыз.',
        options: [
            'және, әрі',
            'өйткені, себебі',
            'бірақ, дегенмен',
            'не, немесе',
            'бірде, біресе',
        ],
        rightAnswer: 1
    },
    {
        question: 'Жинақтық сан есімді белгілеңіз.',
        options: [
            'Белгілеу',
            'Бес',
            'Істеу',
            'Жетеу',
            'Белбеу',
        ],
        rightAnswer: 3
    },
    {
        question: '«Операционная система» сөзі орыс тілінен қазақ тіліне қалай аударылады?',
        options: [
            'бағдарлама',
            'операциялық жүйе',
            'жүйе',
            'анықтама',
            'бағдарламалық жүйе',
        ],
        rightAnswer: 1
    },
    {
        question: 'Салалас құрмалас сөйлем түрін анықтаңыз: «Отан» деген сөзді күнде естиміз, себебі Отан дегеніміз адамның туып-өскен жері.',
        options: [
            'Кезектес',
            'Ыңғайлас',
            'Себеп-салдар',
            'Талғаулы',
            'Қарсылықты',
        ],
        rightAnswer: 2
    },
    {
        question: 'Сан есімнің қай септікте тұрғанын анықтаңыз: Таңертең сағат жетіде тұрамын.',
        options: [
            'Жатыс септік',
            'Атау септік',
            'Ілік септік',
            'Көмектес септік',
            'Барыс септік',
        ],
        rightAnswer: 0
    },
    {
        question: '«Қауіп төндіреді» сөзі қазақ тілінен орыс тіліне қалай аударылады?',
        options: [
            'понижается',
            'вызывает опасность',
            'инфекционные болезни',
            'понижается аппетит',
            'нервная система',
        ],
        rightAnswer: 1
    },
    {
        question: 'Дауысты дыбыстар тілдің қатысына қарай қандай түрлерге бөлінетінін белгілеңіз.',
        options: [
            'Қатаң, ұяң',
            'Үнді, қатаң',
            'Езулік, еріндік',
            'Ашық, қысаң',
            'Жуан, жіңішке',
        ],
        rightAnswer: 4
    },
    {
        question: '«Информация» сөзі орыс тілінен қазақ тіліне қалай аударылады?',
        options: [
            'файл',
            'деректер',
            'ақпарат',
            'жүйе',
            'плагиат',
        ],
        rightAnswer: 2
    },
    {
        question: 'Құрмалас сөйлем жасалу жолына қарай қандай түрлерге бөлінеді?',
        options: [
            'салалас, сабақтас, құрамдас',
            'салалас, сабақтас, аралас',
            'айқындауыш, қосарлы',
            'дара, күрделі',
            'ілгерінді ықпал, кейінді ықпал',
        ],
        rightAnswer: 1
    },
    {
        question: 'Қарсылықты салалас құрмалас сөйлем шылауын көрсетіңіз.',
        options: [
            'Әйтпесе',
            'Әлде',
            'Бірақ',
            'Себебі',
            'Және',
        ],
        rightAnswer: 2
    },
    {
        question: 'Қай сөйлемде біріңғай анықтауыштар кездеседі?',
        options: [
            'Асылбек, Жиренше, Ерболдар да Базаралыға қадала қарап хабар күтті.',
            'Биылғы қыстың басы адамға да, малға да әзір аса жайлы болып тұр.',
            'Дауысы ащы да қатал, зілді де кекті шығады',
            'Мынау екі ақын Абайға көп кезде бірге туысқан аға, інідей көрініп қалды.',
            'Қазақ әндерінде сол дала тауларының, өзендерінің, кең алқаптарының өрнектері бар.',
        ],
        rightAnswer: 2
    },
    {
        question: 'Құрмалас сөйлемді табыңыз.',
        options: [
            'Бұл мәселе сынып сағатында шешілді.',
            'Іңір де түсті, балалар да үйлеріне кірді.',
            'Сыныпқа оқушылардың бәрі жиналды.',
            'Олар мұғаліммен ұзақ әңгімелесті.',
            'Нақты қорытынды жасалды.',
        ],
        rightAnswer: 1
    },
    {
        question: 'Көптік жалғаулы зат есімді табыңыз.',
        options: [
            'Шын',
            'Есік',
            'Өлең',
            'Өтірік',
            'Гүлдер',
        ],
        rightAnswer: 4
    },
    {
        question: 'Қазақ тіліне тән дауысты дыбыстары бар сөзді көрсетіңіз.',
        options: [
            'отан',
            'көзілдірік',
            'достар',
            'саудагер',
            'мемлекет',
        ],
        rightAnswer: 1
    },
    {
        question: 'Тек ашық буыннан құралған сөзді табыңыз.',
        options: [
            'Шағала',
            'Өзге',
            'Алтай',
            'Қарағай',
            'Ойбай',
        ],
        rightAnswer: 0
    },
    {
        question: 'Құрмалас сөйлем түрлерін анықтаңыз.',
        options: [
            'Жалаң, жайылма.',
            'Жалаң, жайылма.',
            'Толымды, толымсыз.',
            'Хабарлы, сұраулы.',
            'Салалас, сабақтас, аралас.',
        ],
        rightAnswer: 4
    },
    {
        question: 'Мақалдың ішінен есімдікті белгілеңіз. Қонағым,өз үйіңді де ойлап отыр.',
        options: [
            'Қонағым',
            'Ойлап отыр',
            'Өз',
            'Үйіңді',
            'Де',
        ],
        rightAnswer: 2
    },
    {
        question: 'Топтау сан есімді көрсетіңіз.',
        options: [
            'Туып- өскен',
            'Үш- үштен',
            'Әркім',
            'Бәйтерек',
            'Әйгілі',
        ],
        rightAnswer: 1
    },
    {
        question: '«Программное обеспечение» сөзі орыс тілінен қазақ тіліне қалай аударылады?',
        options: [
            'аппараттық қамсыздандыру',
            'архитектура',
            'ақпарат',
            'бағдарламалық қамсыздандыру',
            'бағдарлама',
        ],
        rightAnswer: 3
    },
    {
        question: 'Шақыру одағайын табыңыз.',
        options: [
            'көс – көс',
            'уһіледі',
            'е, тәйірі',
            'ойпырмай',
            'бәрекелді',
        ],
        rightAnswer: 0
    },
    {
        question: 'Word редакторында жасалған файлдың кеңейтілуі қандай?',
        options: [
            '.word',
            '.docx',
            '.xlsx',
            '.txt',
            '.bmp',
        ],
        rightAnswer: 1
    },
    {
        question: 'Реттік сан есімді табыңыз.',
        options: [
            'Екі бүтін оннан үш.',
            'Отыз тоғыздан.',
            'Он бір.',
            'Он бірінші.',
            'Он - он бес.',
        ],
        rightAnswer: 3
    },
    {
        question: 'Жүйелік сағат пен пернетақтаның индикаторы қайда орналасады?',
        options: [
            'Басты менюде',
            'Есептер тақтасында',
            'Жұмыс орнында',
            'Таңбашаларда',
            'Қолданбалар батырмаларында',
        ],
        rightAnswer: 1
    },
    {
        question: 'Белгілі бір нәрсе туралы таңбалар мен сигналдар түрінде берілетін мағлұматтарды қалай атайды?',
        options: [
            'Каталог',
            'Құжат',
            'Информация',
            'Файл',
            'Бума',
        ],
        rightAnswer: 2
    },
    {
        question: ' "Пуск" батырмасын басқан кезде не шығады?',
        options: [
            'Бас меню',
            'Таңбаша тақтасы',
            'Жұмыс орны',
            'Есептер тақтасы',
            'Жүйелік тақтасы',
        ],
        rightAnswer: 0
    },
    {
        question: 'Mіcrosoft Offіce-тің құрамындағы, презентациялық материалдар дайындауға арналған программа',
        options: [
            'Дұрыс жауап жоқ',
            'Power Point',
            'Microsoft Access',
            'WordPad',
            'Power Paint',
        ],
        rightAnswer: 1
    },
    {
        question: 'Берілген сөйлемді дұрыс аяқтаңыз. 16 желтоқсан -...',
        options: [
            'Ынтымақ күні',
            'Жеңіс күні.',
            'Республика күні.',
            'Конституция күні.',
            'Тәуелсіздік күні',
        ],
        rightAnswer: 4
    },
    {
        question: 'Сыртқы жад құрылғысына жатады ... .',
        options: [
            'драйвер',
            'процессор',
            'қатты диск ',
            'монитор',
            'дұрыс жауап жоқ',
        ],
        rightAnswer: 2
    },
    {
        question: 'Қазақ халқының ұлттық ойынын белгілеңіз.',
        options: [
            'Лото',
            'Тоғызқұмалақ.',
            'Баскетбол.',
            'Дойбы.',
            'Шахмат.',
        ],
        rightAnswer: 1
    },
    {
        question: 'Компьютер электр желісінен ажыратылса барлық информация қайда өшіріледі?',
        options: [
            'дұрыс жауап жоқ',
            'қатты дискіде ',
            'жедел жадта',
            'CD-ROM дискіде',
            'иілгіш дискіде',
        ],
        rightAnswer: 2
    },
    {
        question: 'Тек үнді дауыссыздары бар сөзді табыңыз.',
        options: [
            'Алпыс.',
            'Азат.',
            'Айман',
            'Сапар.',
            'Аймақ',
        ],
        rightAnswer: 2
    },
    {
        question: '"Корзина" қолданбасы Windows-та не үшін керек?',
        options: [
            'Файл және бумалаар қасиеттерін қарап шығу үшін',
            'Жойылған файл мен бумаларды уақытша сақтау үшін',
            'Қолданбаларды тез іске қосу үшін',
            'Компьютер дискінің мазмұнын шартты түрде көрсететін бұтақты сақтау үшін ',
            'Жергілікті желін баптау үшін ',
        ],
        rightAnswer: 1
    },
    {
        question: 'Excel-де құрылған файлдың кеңейтілуі қандай?',
        options: [
            '.exsx',
            '.xclx',
            '.docx ',
            '.txt',
            '.xlsx',
        ],
        rightAnswer: 4
    },
    {
        question: '«Сұлу» сөзінің синонимін табыңыз',
        options: [
            'Мықты',
            'Әдемі ',
            'Салмақты',
            'Сыпайы',
            'Әдепті',
        ],
        rightAnswer: 1
    },
    {
        question: 'RGB жүйесі қандай информацияны кодтауға арналған?',
        options: [
            'Графикалық информацияны',
            'Мәтіндік информацияны',
            'Сандық информацияны',
            'Дұрыс жауап жоқ',
            'Дыбысты информацияны',
        ],
        rightAnswer: 0
    },
    {
        question: 'Функционалды пернелер деп қандай пернелерді айтамыз?',
        options: [
            'Alt, Shift, Enter',
            'CapsLock, NumLock',
            'Home, Delete, PageDown ',
            'Дұрыс жауап жоқ',
            'F1..F12',
        ],
        rightAnswer: 4
    },
    {
        question: 'Қашықтан компьютерлердегі сақталатын деректер нені жасайды?',
        options: [
            'Интернетті',
            'Аппараттық ресурстарды',
            'Информациялық ресурстарды',
            'Желіні',
            'Хаттаманы',
        ],
        rightAnswer: 2
    },
    {
        question: 'Информатика деген не?',
        options: [
            'Компьютермен жұмыс істеу үйренуге мүмкіндік беретін ғылым',
            'Есептеуіш техника көмегімен құру, сақтау, бейнелеу, өңдеу және деректерді беру әдістерін және де бұл құрылғылардың жұмыс істеуі мен оларды басқару тәсілдерінің принцептерін жүйелейтін техникалық ғылым',
            'Деректерді көшіру, тасымалдау, атын өзгерту және жою тәсілдерін зерттейтін ғылым',
            'Файл құрылымда ұйымдасқан деректерді сақтау, іздеу, сүзу тұралы ғылым',
            'Дұрыс жауап жоқ',
        ],
        rightAnswer: 1
    },
    {
        question: 'Кез-келген Windows-терезенің оң жақ жоғары бұрышында орналасқан батырма не үшін керек?',
        options: [
            'Барлық экранға терезені жазу үшін',
            'Терезені жыймалау үшін',
            'Терезенің өлшемдерін қалпына келтіру үшін ',
            'Терезені жабу үшін',
            'Жұмыс орны бойынша терезені жылжыту үшін',
        ],
        rightAnswer: 3
    },
    {
        question: 'Туынды түбірді анықтаңыз.',
        options: [
            'Тазалық',
            'Жол',
            'Бол',
            'Сынып',
            'Жаңа',
        ],
        rightAnswer: 0
    },
    {
        question: 'Дауысты дыбыстар тілдің қатысына қарай қандай түрлерге бөлінетінін белгілеңіз.',
        options: [
            'Қатаң, ұяң',
            'Жуан, жіңішке',
            'Ашық, қысаң',
            'Үнді, қатаң',
            'Езулік, еріндік',
        ],
        rightAnswer: 1
    },
    {
        question: '«Қауіп төндіреді» сөзі қазақ тілінен орыс тіліне қалай аударылады?',
        options: [
            'понижается аппетит',
            'инфекционные болезни',
            'нервная система',
            'вызывает опасность',
            'понижается',
        ],
        rightAnswer: 3
    },
    {
        question: '«Информационная сеть» сөзі орыс тілінен қазақ тіліне қалай аударылады?',
        options: [
            'ауқымды желі',
            'ақпараттық желі',
            'ақпараттық орта',
            'жергілікті желі',
            'желі',
        ],
        rightAnswer: 1
    },
    {
        question: 'Түсіндірмелі салалас құрмалас сөйлем жалғаулықтарын анықтаңыз.',
        options: [
            'Әйтпесе, немесе',
            'Жалғаулығы жоқ',
            'Өйткені, себебі',
            'Сол үшін, себебі',
            'Сөйтсе де, әйтсе де',
        ],
        rightAnswer: 2
    },
    {
        question: 'Қарсылықты салалас құрмалас сөйлем шылауын көрсетіңіз.',
        options: [
            'Бірақ',
            'Әйтпесе',
            'Себебі',
            'Әлде',
            'Және',
        ],
        rightAnswer: 0
    },
    {
        question: 'Сөйлемнің түрін анықтаңыз.' + '</br>' + 'Ол сабаққа дайындалмаған себебі: кеше кітапханадан кітап таба алмады.',
        options: [
            'Ыңғайлас салалас құрмалас',
            'Түсіндірмелі салалас құрмалас',
            'Кезектес салалас құрмалас',
            'Қарсылықты салалас құрмалас',
            'Талғаулы салалас құрмалас',
        ],
        rightAnswer: 1
    },
    {
        question: '«Информационная система» сөзі орыс тілінен қазақ тіліне қалай аударылады?',
        options: [
            'ақпараттық орта',
            'ақпаратты өңдеу',
            'ақпараттық сала',
            'ақпараттық прогресс',
            'ақпараттық жүйе',
        ],
        rightAnswer: 4
    },
    {
        question: 'Сын есім нені білдіретінін көрсетіңіз.',
        options: [
            'Заттың атын',
            'Заттың іс- қимылының мекенін',
            'Заттың түр-түсін',
            'Заттың қимылын',
            'Заттың іс- қимылының мезгілін',
        ],
        rightAnswer: 2
    },
    {
        question: 'Себеп-салдар салаластың шылауын табыңыз.',
        options: [
            'және, әрі',
            'өйткені, себебі',
            'бірақ, дегенмен',
            'бірде, біресе',
            'не, немесе',
        ],
        rightAnswer: 1
    },
    {
        question: 'Үстеу қандай сөз табы.',
        options: [
            'Заттардың қимыл- әрекетін білдіретін сөз табы',
            'Заттың сындық белгісін білдіретін сөз табы',
            'Қимылдың жайы – күйін, әр түрлі белгілерін сипаттайтын сөз табы',
            'Есім сөздердің орнына жұмсалатын сөз табы',
            'Заттың сандық белгісін білдіретін сөз табы',
        ],
        rightAnswer: 2
    },
    {
        question: 'Қыстырма сөзді табыңыз',
        options: [
            'Алдымнан жақсы кездестің – ау, шырағым.',
            'Ата, немереңіз келді.',
            'Қорыта келгенде, баяндама толық жасалған',
            'Жолдас командир, жолдас комиссар.',
            'Өзің бір қызық жан екенсің.',
        ],
        rightAnswer: 2
    },
    {
        question: '«Ақпарат» сөзі қазақ тілінен орыс тіліне қалай аударылады?',
        options: [
            'алгоритмизация',
            'информация',
            'проектирование',
            'программа',
            'программирование',
        ],
        rightAnswer: 1
    },
    {
        question: 'Қаратпа сөз белгілі бір сөйлем мүшесінің қызметін атқарады ма?',
        options: [
            'пысықтауыш қызметін атқарады',
            'бастауыш қызметін атқарады',
            'толықтауыш қызметін атқарады',
            'баяндауыш қызметін атқармайды',
            'сөйлем мүшесінің қызметін атқармайды',
        ],
        rightAnswer: 4
    },
    {
        question: 'Тұйық етістікті анықтаңыз.',
        options: [
            'Қу',
            'Ұнау',
            'Жу',
            'Айтыс',
            'Көрсет',
        ],
        rightAnswer: 1
    },
    {
        question: 'Бірыңғай мүшелерді байланыстыру үшін қандай жалғаулық шылау қолдану керек?' + '<br>' + 'Ол...биік,…аласа,…қатал,…жұмсақ,..мінезді,…шешен,…сараң сөзді еді.',
        options: [
            'бірде',
            'да',
            'бірақ',
            'немесе',
            'және',
        ],
        rightAnswer: 0
    },
    {
        question: 'Төл сөздің дұыс анықтамасын көрсетіңіз.',
        options: [
            'Біреудің сөзін бұлжытпай, өзгеріссіз беру',
            'Біреудің айтқан сөзінің өзгерген нұсқасы',
            'Өсиет сөз',
            'Бағыштап айтылған сөз',
            'Автордың өзінің айтқан сөзі',
        ],
        rightAnswer: 4
    },
    {
        question: 'Буын үндестігіне бағынбай тұрған біріккен сөздерді табыңыз.',
        options: [
            'Бірсігүні, ендігәрі',
            'Сарыарқа, Талдықорған',
            'Көкшетау, Екібастұз',
            'Халықаралық, өнеркәсіп',
            'Ақсуат, Сарысу',
        ],
        rightAnswer: 2
    },
    {
        question: 'Ауыспалы осы шақта тұрған етістікті белгілеңіз.',
        options: [
            'Биле',
            'Билейді',
            'Билеген',
            'Биледі',
            'Билеу',
        ],
        rightAnswer: 1
    },
    {
        question: 'Өткен шақтағы етістікті табыңыз.',
        options: [
            'Көрмеу',
            'Ақша',
            'Ақшыл',
            'Бітірді',
            'Келе жатыр',
        ],
        rightAnswer: 3
    },
    {
        question: 'Қыстырма сөзді табыңыз.',
        options: [
            'Сірә',
            'Қызыл',
            'Ей',
            'Балам',
            'Жеті',
        ],
        rightAnswer: 0
    },
    {
        question: 'Баяндауышты табыңыз. Күзде жыл құстары жылы жаққа ұшып кетеді.',
        options: [
            'Жылы.',
            'Ұшып кетеді.',
            'Жыл құстары.',
            'Күзде.',
            'Жакқа.',
        ],
        rightAnswer: 1
    },
    {
        question: 'Жедел жад не үшін арналған?',
        options: [
            'Дұрыс жауап жоқ',
            'Информацияны сақтауға',
            'Информацияны өндеуге',
            'Берілген уақыт мезгілінде бір программаны өндеуге',
            'Программаларды іске қосуға',
        ],
        rightAnswer: 3
    },
    {
        question: 'Реттік сан есімді табыңыз.',
        options: [
            'Отыз тоғыздан.',
            'Он бірінші.',
            'Он бір.',
            'Екі бүтін оннан үш.',
            'Он - он бес.',
        ],
        rightAnswer: 1
    },
    {
        question: 'Шартты райлы етістікті табыңыз.',
        options: [
            'Ертең мектепке кел.',
            'Өзің білесің, біз момын шаруамыз.',
            'Бір көрсем, арманым болмас еді.',
            'Содан кейін мені сына.',
            'Жүкті шешпе, үйді әуре қыласың.',
        ],
        rightAnswer: 2
    },
    {
        question: 'Бірнеше терезе бір мезгілде ашық бола ала ма?',
        options: [
            'Иә',
            'Иә, бірақ 5-тен артық емес ',
            'Иә, егер олардың тақырыптары бір мезгілде жарық түспен ерекшеленген',
            'Иә, егер олардың барлығы ерекшеленген',
            'Жоқ',
        ],
        rightAnswer: 0
    },
    {
        question: 'Excel-де құрылған файлдың кеңейтілуі қандай?  ',
        options: [
            '.exsx',
            '.xlsx',
            '.xclx',
            '.docx',
            '.txt',
        ],
        rightAnswer: 1
    },
    {
        question: 'Windows-та объекттің орын ауыстыруы қалай іске асырылады?',
        options: [
            'Shift пернесін басып тұрып объекті сүйрету',
            'F6 функционалды пернесінің көмегімен ',
            'Ctrl пернесін басып тұрып, тышқанның оң жақ батырмасымен объектті сүйрету ',
            'Ctrl пернесін басып тұрып, тышқанның сол жақ батырмасымен объектті сүйрету ',
            'Тышқанның сол жақ батырмасымен сүйретіп',
        ],
        rightAnswer: 4
    },
    {
        question: 'Контексті менюді қалай шақыруға болады?',
        options: [
            'Windows-та мынадай менюдің түрі жоқ',
            'Керекті объект активті болғанда ALT пернені басып',
            'Тышқанныңың оң жақ батырмасын шертіп ',
            'Керекті объектіге курсорды қойып тышқанның сол жақ пернесін басып',
            'Объектті қос шерту',
        ],
        rightAnswer: 2
    },
    {
        question: 'Файл аты айқын объекті идентификациялауға мүмкіндік береді, ал кеңейтілуі нені сипаттайды?',
        options: [
            'Жасау уақытын',
            'Типін',
            'Каталогын',
            'Өлшемін',
            'Жолын',
        ],
        rightAnswer: 1
    },
    {
        question: 'Windows - терезенің оң жақ жоғары бұрышындағы үш батырманың ортасында тұрған батырма не үшін керек?',
        options: [
            'жұмыс орны бойынша терезені жылжыту үшін',
            'терезенің өлшемдерін қалпына келтіру үшін ',
            'терезені экранға толық ашу үшін ',
            'терезені ықшамдау үшін',
            'терезені жабу үшін',
        ],
        rightAnswer: 2
    },
    {
        question: 'Берілген сөйлемді дұрыс аяқтаңыз. 30 тамыз -...',
        options: [
            'Тәуелсіздік күні.',
            'Жеңіс күні.',
            'Конституция күні.',
            'Ынтымақ күні.',
            'Республика күні.',
        ],
        rightAnswer: 2
    },
    {
        question: 'Word-тағы кестенің басқа ұяшығына ауысу үшін не істеу керек?',
        options: [
            'Esc пернесін басу',
            'Тышқанды басқару пернелерін пайдалану',
            'Enter пернесін басу',
            'Home пернесін басу',
            'End пернесін басу',
        ],
        rightAnswer: 1
    },
    {
        question: '"Мой компьютер" таңбашасы не үшін қажет?',
        options: [
            'Жойылған файлдармен бумалардыды сақтау үшін',
            'Жергілікті желін баптау үшін',
            'Файл және бумаларар қасиеттерін қарап шығу үшін',
            'Windows қолданбалы программаларын іске қосу үшін',
            'Компьютер дискінің мазмұнын шартты түрде көрсететін бұтақты сақтау үшін',
        ],
        rightAnswer: 4
    },
    {
        question: 'Windows программасы программалық жасаудың қандай типіне жатады?',
        options: [
            'Стандартты қолданбалар',
            'Операциялық жүйелер',
            'Драйверлер',
            'Қолданбалы программалар',
            'Құрамдас енгізу-шығару жүйесі',
        ],
        rightAnswer: 1
    },
    {
        question: 'Компьютер электр желісінен ажыратылса барлық информация қайда өшіріледі?',
        options: [
            'жедел жадта',
            'қатты дискіде',
            'CD-ROM дискіде',
            'иілгіш дискіде',
            'дұрыс жауап жоқ',
        ],
        rightAnswer: 0
    },
    {
        question: 'Операциялық жүйе қандай функцияларды атқарады?',
        options: [
            'Компьютермен және түрлі шалғай құрылғылар арасында деректер алмасуды ұйымдастыру',
            'Дұрыс жауап жоқ',
            'Еңгізу-шығару құрылғыларын іске қосу ',
            'Файлдарды сақтау және ұйымдастыру',
            'Пайдаланушымен диалогты ұйымдастыру, аппаратураны және компьютер қорын басқару',
        ],
        rightAnswer: 4
    },
    {
        question: 'Курсордың жолдың аяғына тез ауысуын қандай перне орындайды?',
        options: [
            'Shift',
            'Ctrl',
            'End',
            'Esc',
            'Insert',
        ],
        rightAnswer: 2
    },
    {
        question: 'Синоним сөздерді табыңыз.',
        options: [
            'Бас, жақ.',
            'Әдемі, сұлу.',
            'Бас, аяқ.',
            'Мұғалім, оқушы.',
            'Үлкен, кіші.',
        ],
        rightAnswer: 1
    },
    {
        question: 'Ұяң дауыссыздан басталған қосымшаны табыңыз.',
        options: [
            'Баласыңдар.',
            'Терезелер.',
            'Жастығымыз.',
            'Қызға.',
            'Доптың.',
        ],
        rightAnswer: 3
    },
    {
        question: 'Жойылған объектілер уақытша түсетін қапшықты қалай атайды?',
        options: [
            '"Қоржын"',
            'Блокнот',
            'Бума',
            'Опретивтік қапшық',
            'Дұрыс жауап жоқ',
        ],
        rightAnswer: 0
    },
    {
        question: 'Сын есімнің салыстырмалы шырайын анықтаңыз.',
        options: [
            'Ауыспалы',
            'Тәжірибесіз',
            'Әдемілеу',
            'Ауылдық',
            'Күзгі',
        ],
        rightAnswer: 2
    },
    {
        question: 'Қай сөйлемде біріңғай анықтауыштар кездеседі?',
        options: [
            'Қазақ әндерінде сол дала тауларының, өзендерінің, кең алқаптарының өрнектері бар.',
            'Дауысы ащы да қатал, зілді де кекті шығады',
            'Биылғы қыстың басы адамға да, малға да әзір аса жайлы болып тұр.',
            'Асылбек, Жиренше, Ерболдар да Базаралыға қадала қарап хабар күтті.',
            'Мынау екі ақын Абайға көп кезде бірге туысқан аға, інідей көрініп қалды.',
        ],
        rightAnswer: 1
    },
    {
        question: 'Қатаң дауыссыз дыбыстарды көрсетіңіз.',
        options: [
            'й, л, м',
            'н, р, у',
            'б, в, г, ғ',
            'қ, к, п, с',
            'д, ж, з, һ',
        ],
        rightAnswer: 3
    },
    {
        question: 'Үндестік заңына бағынбайтын сөзді табыңыз.',
        options: [
            'Жарыс',
            'Арман',
            'Жүйрік',
            'Атақты',
            'Жеңімпаз',
        ],
        rightAnswer: 4
    },
    {
        question: 'Оқшау сөзді көрсетіңіз.',
        options: [
            'қыстырма',
            'жалғаулық',
            'шырай',
            'үстеу',
            'шылау',
        ],
        rightAnswer: 0
    },
    {
        question: 'Болымды етістікті табыңыз.',
        options: [
            'Жумады',
            'Сүртті',
            'Әкелмеді',
            'Ұшпады',
            'Көрсетпеді',
        ],
        rightAnswer: 1
    },
    {
        question: 'Күрделі сын есімді табыңыз.',
        options: [
            'Таза',
            'Шыдамды',
            'Ұзақ',
            'Орта бойлы',
            'Тұнық',
        ],
        rightAnswer: 3
    },
    {
        question: 'Көптік жалғаулы зат есімді табыңыз.',
        options: [
            'Шын',
            'Есік',
            'Гүлдер',
            'Өтірік',
            'Өлең',
        ],
        rightAnswer: 2
    },
    {
        question: '«Және, мен, пен» шылауларымен жасалатын сөйлемнің түрін анықтаңыз.',
        options: [
            'Шартты бағыныңқылы сабақтас',
            'Қарсылықты салалас құрмалас',
            'Қарсылықты салалас құрмалас',
            'Кезектес салалас құрмалас',
            'Ыңғайлас сабақтас құрмалас',
        ],
        rightAnswer: 4
    },
    {
        question: 'Қарсылықты салалас құрмалас сөйлемнің жалғаулықтарын табыңыздар.',
        options: [
            'Және, әрі, да, де',
            'Өйткені, сондықтан, себебі',
            'Бірақ, дегенмен, алайда',
            'Бірде, біресе',
            'Не, немесе, яғни',
        ],
        rightAnswer: 2
    },
    {
        question: 'Құрмалас сөйлем жасалу жолына қарай қандай түрлерге бөлінеді?',
        options: [
            'салалас, сабақтас, құрамдас',
            'салалас, сабақтас, аралас',
            'айқындауыш, қосарлы',
            'дара, күрделі',
            'ілгерінді ықпал, кейінді ықпал',
        ],
        rightAnswer: 1
    },
    {
        question: 'Күрделі етістікті табыңыз.',
        options: [
            'Айтуды',
            'Береді',
            'Бастады',
            'Ойланып қалды',
            'Барды',
        ],
        rightAnswer: 3
    },
    {
        question: '«Мемлекет» сөзінде қанша буын барын табыңыз.',
        options: [
            '6',
            '4',
            '5',
            '2',
            '3',
        ],
        rightAnswer: 4
    },
    {
        question: 'Себеп-салдар салаластың шылауын табыңыз.',
        options: [
            'өйткені, себебі',
            'не, немесе',
            'бірақ, дегенмен',
            'және, әрі',
            'бірде, біресе',
        ],
        rightAnswer: 0
    },
    {
        question: '«Желсіз түнде жарық ай» қай ақынның өлеңі?',
        options: [
            'Шәкәрім Құдайбердиев',
            'Қасым Аманжолов',
            'Абай Құнанбайұлы',
            'Мұқағали Мақатаев',
            'Иса Байзақов',
        ],
        rightAnswer: 2
    },
    {
        question: 'Оқшау сөздер кездескенде, сөйлемде қандай тыныс белгісі қойылады?',
        options: [
            'үтір',
            'нүктелі үтір',
            'қос нүкте',
            'нүкте',
            'тырнақша',
        ],
        rightAnswer: 0
    },
    {
        question: 'Бірыңғай мүшелердің анықтамасын табыңыз.',
        options: [
            'дыбысталуы бірдей сөйлем мүшелері',
            'синтаксистік қызметі бірдей, өзара тұлғалас сөйлем мүшелері',
            'әр сөз табына жататын сөйлем мүшелері.',
            'әр түрлі сұраққа жауап беретін сөйлем мүшелері',
            'тұлғасы әр түрлі сөйлем мүшелері',
        ],
        rightAnswer: 1
    },
    {
        question: 'Қазақ тіліне тән дауысты дыбыстары бар сөзді көрсетіңіз.',
        options: [
            'саудагер',
            'достар',
            'мемлекет',
            'көзілдірік',
            'отан',
        ],
        rightAnswer: 3
    },
    {
        question: '«Деректер қоры» сөзі қазақ тілінен орыс тіліне қалай аударылады?',
        options: [
            'накопитель',
            'проек',
            'алгоритм',
            'программа',
            'база данных',
        ],
        rightAnswer: 4
    },
    {
        question: 'Дауысты дыбыстардың еріннің қатысына қарай жіктелетін түрлерін көрсетіңіз.',
        options: [
            'еріндік, езулік',
            'қысаң, ашық',
            'қатаң, ұяң',
            'жуан, жіңішке',
            'үнді, ұяң',
        ],
        rightAnswer: 0
    },
    {
        question: 'Word программасы не үшін керек?',
        options: [
            'Жүйелік баптауларды атқару үшін',
            'Кестелік деректермен жұмыс істеу үшін, құрама деректер кестелерін жасау үшін',
            'Мәтін құжаттарын электронды түрде жасау және өңдеу үшін',
            'Компьютердің файлдық жүйесі бойынша іздеу',
            'Деректер базасымен жұмыс істеу үшін',
        ],
        rightAnswer: 2
    },
    {
        question: '- дар, - дер, - тар, - тер, - лар, - лер жалғаудың қай түріне жататынын көрсетіңіз.',
        options: [
            'Тәуелдік',
            'Көптік',
            'Жіктік',
            'Септік',
            'Етістік',
        ],
        rightAnswer: 1
    },
    {
        question: 'Бас менюдің "Поиск" пунктісі не үшін қолданылады?',
        options: [
            'жүйе құрауышыларын баптау',
            'компьютерді тұрақтату',
            'соңғы 15 құжаттар тізімін шығару',
            'файлдар мен бумаларды іздеу',
            'программаларды тез іске қосу',
        ],
        rightAnswer: 3
    },
    {
        question: 'Екілік кодпен барлық математикалық операцияларды қандай құрылғы жасайды?',
        options: [
            'CD-ROM',
            'Тышқан',
            'Монитор',
            'Қатты диск',
            'Орталық процессор',
        ],
        rightAnswer: 4
    },
    {
        question: 'Тышқанның оң жақ батырмасымен түрлі Windows объектісін басқан кезде не шығады? ',
        options: [
            'Контекстті меню',
            'Объекттің диалогты терезесі шығады',
            'Қолданбалы программа ашылады ',
            '"Главное меню" терезесі',
            'Бума ашылады',
        ],
        rightAnswer: 0
    },
    {
        question: 'Енгізу-шығару порты не үшін қолданылады?',
        options: [
            'Деректреді ЭЕМ-ң оперативтік жадында сақтау үшін',
            'Компьютерді сыртқы құрылғылармен байланыстыру үшін',
            'Деректерді Интернетке шығару үшін',
            'Жаңа программалық дестесімен жұмыс істеу үшін',
            'Деректерді модификациялау үшін',
        ],
        rightAnswer: 1
    },
    {
        question: 'Реттік сан есім нені білдіретінін көрсетіңіз.',
        options: [
            'Заттың санын топтап көрсетеді.',
            'Заттың санын жинақтап көрсетеді',
            'Заттың дәл нақты санын білдіреді.',
            'Заттың реттік санын білдіреді.',
            'Заттың санын бөлшектеп көрсетеді.',
        ],
        rightAnswer: 3
    },
    {
        question: 'Жүйелік сағат пен пернетақтаның индикаторы қайда орналасады?',
        options: [
            'Қолданбалар батырмаларында',
            'Басты менюде',
            'Есептер тақтасында',
            'Таңбашаларда',
            'Жұмыс орнында',
        ],
        rightAnswer: 2
    },
    {
        question: 'Сыртқы жад құрылғысына жатады ... .',
        options: [
            'процессор',
            'дұрыс жауап жоқ',
            'монитор',
            'драйвер',
            'қатты диск',
        ],
        rightAnswer: 4
    },
    {
        question: 'Монитор дегеніміз... . ',
        options: [
            'деректерді өзгертетін құрылғы',
            'деректерді енгізетін құрылғы',
            'компьютердің шығару құрылғысы',
            'деректерді дайындайтын құрылғы',
            'деректерді жинайтын құрылғы',
        ],
        rightAnswer: 2
    },
    {
        question: 'Курсордың жолдың басына тез ауысуын қандай перне орындайды?',
        options: [
            'Insert',
            'Home',
            'Esc',
            'Shift',
            'Ctrl',
        ],
        rightAnswer: 1
    },
    {
        question: 'Пайдаланушы интерфейсі деген не?',
        options: [
            'Windows терезелерінің сыртқы түрі',
            'Адамның программалық құрылғылармен өзара әрекеттесу әдістері мен құралдары',
            'Есептеуіш техниканың құралдарын аппараттық қамтамасуы',
            'Адамның аппараттық және программалық құрылғылармен өзара әрекеттесу әдістері мен құралдары',
            'Адамның аппараттық құрылғылармен өзара әрекеттесу әдістері мен құралдары',
        ],
        rightAnswer: 3
    },
    {
        question: 'Белгілі бір нәрсе туралы таңбалар мен сигналдар түрінде берілетін мағлұматтарды қалай атайды?',
        options: [
            'Файл',
            'Каталог',
            'Бума',
            'Құжат',
            'Информация',
        ],
        rightAnswer: 4
    },
    {
        question: 'RGB жүйесі қандай информацияны кодтауға арналған?',
        options: [
            'Графикалық информацияны',
            'Мәтіндік информацияны',
            'Дыбысты информацияны',
            'Дұрыс жауап жоқ',
            'Сандық информацияны',
        ],
        rightAnswer: 0
    },
    {
        question: 'Белгілі бір атпен аталған дискідегі біртекті мәліметтер жиыны қалай аталады?',
        options: [
            'Каталог',
            'Деректер',
            'файл',
            'Бума',
            'Информация',
        ],
        rightAnswer: 2
    },
    {
        question: 'Windows деген не?',
        options: [
            'Операциялық жүйе',
            'Қолданбалы программа',
            'Құрамдас енгізу-шығару жүйе',
            'Қолданба',
            'Программалау тілі ',
        ],
        rightAnswer: 0
    },
    {
        question: 'Excel формуласында пайдаланатын, формуланы басқа орынға көшірген кезде өзгермейтін, ұяшыққа сілтеме қалай деп аталады?',
        options: [
            'ұяшыққа аралас сілтеме',
            'ұяшыққа абсолют сілтеме',
            'автоқосындылау',
            'автоауыстыру',
            'ұяшыққа салыстырмалы сілтеме',
        ],
        rightAnswer: 1
    },
    {
        question: 'Күзден кейін келетін жыл мезгілін көрсетіңіз.',
        options: [
            'Жаз',
            'Апта',
            'Көктем',
            'Қыс',
            'Күз',
        ],
        rightAnswer: 3
    },
    {
        question: 'Mіcrosoft Offіce-тің құрамындағы, презентациялық материалдар дайындауға арналған программа',
        options: [
            'Дұрыс жауап жоқ',
            'WordPad',
            'Power Paint',
            'Microsoft Access',
            'Power Point',
        ],
        rightAnswer: 4
    },
    {
        question: 'Бірнеше терезе бір мезгілде активті болуы мүмкін бе?',
        options: [
            'Жоқ',
            'Иә, егер олардың барлығы ерекшеленген',
            'Иә, егер олардың тақырыбы жарық түспен ерекшеленген',
            'Жоқ, өйткені Windows-та бірнеше терезені бір мезгілде ашуға болмайды',
            'Иә',
        ],
        rightAnswer: 0
    },
    {
        question: 'Баяндауыш қай сөз табынан жасалғанын көрсетіңіз: Нағыз теңіз романтикасы деген осы.',
        options: [
            'Етістік',
            'Үстеу',
            'Есімдік',
            'Одағай',
            'Зат есім',
        ],
        rightAnswer: 2
    },
    {
        question: 'Буын түрін анықтаңыз.',
        options: [
            'Тасымал',
            'Тұйық',
            'Буын',
            'Жалаң',
            'Жалғау',
        ],
        rightAnswer: 1
    },
    {
        question: '«Сән» дегеніміз не?.',
        options: [
            'киімді ұсыну',
            'киім өлшеу',
            'киімді көрсету',
            'киім кию мәдениеті',
            'киім тігу',
        ],
        rightAnswer: 3
    },
    {
        question: 'Төл сөзге байланысты тыныс белгілері дұрыс қойылған сөйлемді аңықтаңыз.',
        options: [
            '«Сен радио тыңдайсың ба, деп сұрады досым.»',
            '«Сен радио тыңдайсың ба»- деп сұрады досым.',
            '«Сен радио тыңдайсың ба?- деп сұрады досым.',
            'Сен радио тыңдайсың ба, деп сұрады досым.',
            '«Сен радио тыңдайсың ба?»- деп сұрады досым.',
        ],
        rightAnswer: 4
    },
    {
        question: 'Буынға бөлінбейтін сөзді белгілеңіз.',
        options: [
            'Серт.',
            'Ереже.',
            'Уәде.',
            'Болжам.',
            'Қағида.',
        ],
        rightAnswer: 0
    },
    {
        question: 'Қандай пернелер комбинациясы Windows-ң бас менюін автоматты түрде шақырады?',
        options: [
            'F2',
            'Ctrl+Esc',
            'Alt+F4',
            'Exit',
            'Бас меню',
        ],
        rightAnswer: 1
    },
    {
        question: 'Сөйлемдегі есімдіктердің түрін анықтаңыз: Мен ешқашан елімді сатпаймын!',
        options: [
            'Жалпылау, белгісіздік.',
            'Сілтеу, жалпылау.',
            'Жіктеу, өздік.',
            'Жіктеу, болымсыздық.',
            'Жіктеу, сілтеу.',
        ],
        rightAnswer: 3
    },
    {
        question: 'Ауыспалы осы шақта тұрған етістікті белгілеңіз.',
        options: [
            'Биледі',
            'Билеген',
            'Билейді',
            'Биле',
            'Билеу',
        ],
        rightAnswer: 2
    },
    {
        question: 'Операциялық жүйе қандай функцияларды атқарады?',
        options: [
            'Дұрыс жауап жоқ',
            'Компьютермен және түрлі шалғай құрылғылар арасында деректер алмасуды ұйымдастыру',
            'Еңгізу-шығару құрылғыларын іске қосу',
            'Файлдарды сақтау және ұйымдастыру',
            'Пайдаланушымен диалогты ұйымдастыру, аппаратураны және компьютер қорын басқару',
        ],
        rightAnswer: 4
    },
    {
        question: 'Word дегеніміз не?',
        options: [
            'Компьютер моделі',
            'Графикалық редактор',
            'Мәтіндік редактор',
            'Кестелік процессор',
            'Монитор моделі',
        ],
        rightAnswer: 2
    },
    {
        question: 'Күрделі етістікті табыңыз.',
        options: [
            'Барды',
            'Ойланып қалды',
            'Бастады',
            'Береді',
            'Айтуды',
        ],
        rightAnswer: 1
    },
    {
        question: '«Ашу- дұшпан, ақыл- дос. Ақылыңа ақыл.....» мақалды аяқтаңыз.',
        options: [
            'сал',
            'бер',
            'сөз',
            'қос',
            'айт',
        ],
        rightAnswer: 3
    },
    {
        question: 'Құрмалас сөйлем түрін анықтаңыз: Оқуға түспеймін, өйткені жұмыс істеуім керек.',
        options: [
            'Талғаулы',
            'Ыңғайластық',
            'Себеп-салдар',
            'Кезектес',
            'Түсіндірмелі',
        ],
        rightAnswer: 4
    },
    {
        question: 'Тек жіңішке дауысты дыбыстар қатарын анықтаңыз.',
        options: [
            'Ә, ө, і',
            'А, ә, е',
            'О, ө, у',
            'Э, о',
            'Ы, і, и',
        ],
        rightAnswer: 0
    },
    {
        question: 'Windows-та объекттің көшірілуі қалай жасалынады?',
        options: [
            'F5 функционалды пернесінің көмегімен',
            'Ctrl пернесін басып тұрып тышқанның оң жақ батырмасымен объектті сүйрету',
            'Ctrl пернесін басып тұрып тышқанның сол жақ батырмасымен объектті сүйрету',
            'Тышқанның сол жақ батырмасымен сүйретіп',
            'Shift пернесін басып тұрып объектті сүйрету',
        ],
        rightAnswer: 2
    },
    {
        question: '1 Мбайт нешеге тең?',
        options: [
            '1024 байт',
            '1024 Гбайт',
            '1204 байт',
            '1 байт',
            'Дұрыс жауап жоқ',
        ],
        rightAnswer: 0
    },
    {
        question: 'Жекіру одағайын көрсетіңіз.',
        options: [
            'Кә -кә',
            'Жә',
            'Уһ',
            'Пай-пай',
            'Шөк',
        ],
        rightAnswer: 1
    },
    {
        question: 'Берілген жауаптардың қайсысы аппараттық жасауға жатпайды?',
        options: [
            'Жүйелік тақша',
            'Иілгіш дискінің контроллеры',
            'Қатты дискінің контроллеры',
            'Операциялық жүйе',
            'Орталық процессор',
        ],
        rightAnswer: 3
    },
    {
        question: 'Түсіндірмелі салалас құрмалас сөйлемнің жасалу жолын көрсетіңіз.',
        options: [
            'Жалғаулықсыз',
            'Немесе',
            'Бірде',
            'Сөйткенмен',
            'Сондықтан',
        ],
        rightAnswer: 4
    },
    {
        question: 'Файл аты, файл өлшемі, соңғы өзгертуінің уақыты мен мерзім және т.б. файл туралы мәліметтер жазылатын дискідегі арнайы орын қалай аталады?',
        options: [
            'Бума',
            'Кесте',
            'Файл',
            '"Мои документы"',
            'Жүйелік блок',
        ],
        rightAnswer: 0
    },
    {
        question: 'Кезектес салалас құрмалас сөйлем шылауларын көрсетіңіз.',
        options: [
            'Бірде',
            'Өйткені',
            'Немесе',
            'Әйтсе де',
            'Сондықтан',
        ],
        rightAnswer: 0
    },
];
  
numberOfAllQuestion.innerHTML = questions.length;  // выводим кол-во вопросов

const load = () => {
    question.innerHTML = questions[indexOfQuestion].question; // сам вопрос

    option1.innerHTML = questions[indexOfQuestion].options[0];
    option2.innerHTML = questions[indexOfQuestion].options[1];
    option3.innerHTML = questions[indexOfQuestion].options[2];
    option4.innerHTML = questions[indexOfQuestion].options[3];
    option5.innerHTML = questions[indexOfQuestion].options[4];

    numberOfQuestion.innerHTML = indexOfPage + 1; // устоновка номера страницы 
    indexOfPage++;
};

let comletedAnswers = [];

const randomQuestion = () => {
    let randomNumber = Math.floor(Math.random() * questions.length);
    let hitDuplicate = false;

    if(indexOfPage == questions.length) {
        quizOver();
    } else {
        if(comletedAnswers.length > 0) {
            comletedAnswers.forEach(item => {
                if(item == randomNumber) {
                    hitDuplicate = true;
                }
            });
            if(hitDuplicate) {
                randomQuestion();
            } else {
                indexOfQuestion = randomNumber;
                load();
            }
        }
        if(comletedAnswers == 0) {
            indexOfQuestion = randomNumber;
            load();
        }
    }
    comletedAnswers.push(indexOfQuestion);
};



const checkAnswer = el => {
    if(el.target.dataset.id == questions[indexOfQuestion].rightAnswer) {
        el.target.classList.add('correct');
        updateAnswerTracker('correct');
        score++;
    } else {
        el.target.classList.add('wrong');
        updateAnswerTracker('wrong');
    }
    disabledOptions();
};

const disabledOptions = () => {
    optionElements.forEach(item => {
        item.classList.add('disabled');
        if(item.dataset.id == questions[indexOfQuestion].rightAnswer) {
            item.classList.add('correct');
        }
    });
};

const enableOptions = () => {
    optionElements.forEach(item => {
        item.classList.remove('disabled', 'correct', 'wrong');
    });
};

const answerTracker = () => {
    questions.forEach(() => {
         const div = document.createElement('div');
         answersTracker.appendChild(div);
    });
};

const updateAnswerTracker = status => {
    answersTracker.children[indexOfPage - 1].classList.add(`${status}`);
};

const attModal = document.querySelector('.attention-over-modal');
const btnClosed = document.getElementById("btn-close");

btnClosed.addEventListener('click', function () {
    attModal.classList.remove('actived');
});

const validate = () => {
    if(!optionElements[0].classList.contains('disabled')) {
       attModal.classList.add('actived');
    } else {
        randomQuestion();
        enableOptions();
    }

};

btnNext.addEventListener('click', validate);

for(option of optionElements) {
    option.addEventListener('click', e => checkAnswer(e));
}

const quizOver = () => {
    document.querySelector('.quiz-over-modal').classList.add('active');
    correctAnswer.innerHTML = score;
    numberOfAllQuestion2.innerHTML = questions.length;
    coratten();
    document.getElementById('btn-next').value= "ЗАВЕРШИТЬ";   
};

const tryAgain = () => {
    window.location.reload();
};

btnTryAgain.addEventListener('click', tryAgain);

window.addEventListener('load', () => {
    randomQuestion();
    answerTracker();
});