/* все ответы */
const option1 = document.querySelector('.option1');
const option2 = document.querySelector('.option2');
const option3 = document.querySelector('.option3');
const option4 = document.querySelector('.option4');
const option5 = document.querySelector('.option5');

/* все вопросы */
const optionElements = document.querySelectorAll('.option');

const question = document.getElementById('question'),
      numberOfQuestion = document.getElementById('number-of-question'),
      numberOfAllQuestion = document.getElementById('number-of-all-questions');

let indexOfQuestion, // индекс текущего вопроса
    indexOfPage = 0; // индекс страниц

const answersTracker = document.getElementById('answers-tracker');
const btnNext = document.getElementById('btn-next');

let score = 0; // Итоговый Результат

const correctAnswer = document.getElementById('correct-answer'),
      numberOfAllQuestion2 = document.getElementById('number-of-all-questions-2'),
      btnTryAgain = document.getElementById('btn-try-again'),
      msgOfResult = document.getElementById('msgOfResult'),
      br = "</br>";


const questions = [
    {
        question: 'Берілген f(X) кестелік функциясы үшін F(x) жуықтау функциясының құрылысы міндетті түрде - түйін нүктелеріндегі F(x) және f(x) мәндерінің сәйкес келуі – егер x аргументі тең мәндерге ие болса, жүргізілсін. Көршілес интерполяция түйіндеріндегі функция мәндері арасындағы айырмашылықтар деп аталады',
        options: [
            'Интерполяцияның түйіндік нүктелері',
            'Тең шығатын интерполяция түйіндері',
            'Екінші ретті ақырлы айырмашылықтар',
            'Бірінші ретті ақырлы айырмашылықтар ',
            'Функция аргументін өзгерту қадамы',
        ],
        rightAnswer: 3
    },
    {
        question: 'Сызықтық теңдеулер жүйесін шешу үшін қайталанатын түрге эквивалентті түрлендіру жасалды. Нәтижесінде жүйе келесідей болады: ' + br + '<img src="qst2.png" class="sistems">' + br + 'Конвергенция шарты орындалғанын тексеріңіз. Оң жауаппен α параметрін анықтаңыз',
        options: [
            'α = 1,02',
            'α = 0,8',
            'α = 0,9',
            'конвергенция шарттарының ешқайсысы орындалмайды',
            'α = 0,7',
        ],
        rightAnswer: 2
    },
    {
        question: 'Сызықтық теңдеулер жүйесі белгісіз коэффициенттер матрицасы келесідей болсын: ' + br + '<img src="qst3.png">' + 'Жүйе теңдіктерінің оң жағы B = (3; -1) векторымен ұсынылған. Жүйені Сейдель әдісімен шешу үшін сол жақ «қалыпты» түрге ауыстырылды. Түрлендірілген жүйенің коэффициенттері матрицаны құрады',
        options: [
            '<img src="ans3.2.png">',
            '<img src="ans3.1.png">',
            '<img src="ans3.3.png">',
            '<img src="ans3.4.png">',
            '<img src="ans3.5.png">',
        ],
        rightAnswer: 2
    },
    {
        question: 'F(x) = 0 теңдеуінің сандық шешімі үшін eps=0.01 дәлдігімен қарапайым Итерация әдісімен Итерация тізбегі құрылды. Конвергенция шартын тексеру нәтижесінде q=0.2 нақты саны алынды. Содан кейін есептеулерді тоқтату критерийі абсолютті шамадағы екі көршілес жуықтаудың айырмашылығы мәннен аспайтын жағдай деп санауға болады',
        options: [
            '0.25',
            '0.02',
            '0.01',
            '0.04',
            '0.002',
        ],
        rightAnswer: 3
    },
    {
        question: '[a,b] сегментіндегі F(x)=0 теңдеуінің сандық шешімін жартылай бөлу әдісін бағдарламалық түрде жүзеге асыруда c=(a+b)/2 ортасы табылды. Егер F(b)*F(c)<0 шарты дұрыс болса, онда пәрменді орындау керек (C++ синтаксис)',
        options: [
            'a=b',
            'a=c',
            'c=a',
            'b=c',
            'c=b',
        ],
        rightAnswer: 1
    },
    {
        question: 'Сызықтық теңдеулер жүйесі эквивалентті итерациялық түрге айналдырылсын: ' + "<img src='qst6.png' class='sistems'>" + ' Конвергенцияны тексеру оң нәтиже берді. Бастапқы жуықтау келесідей болсын: x1=0, x2=0, x3=0. Содан кейін бірінші жуықтау келесідей болады',
        options: [
            'x1 = 0,8, x2 = -1, x3 = 1',
            'x1 = -0,8, x2 = 1, x3 = -1',
            'x1 = -1, x2 = 1, x3 = -1',
            'x1 = 0, x2 = 0, x3 = 1',
            'x1 = 1, x2 = -1, x3 = 1',
        ],
        rightAnswer: 4
    },
    {
        question: 'F(x)=0 теңдеуінің түбірлерін жартылай бөлу әдісімен нақтылау нәтижесінде түбірі бар [0.35, 0.45] маңы алынды. Содан кейін теңдеудің түбірі ретінде орташа мәнді алып, мәннен аспайтын қателік аламыз',
        options: [
            '0.09',
            '0.445',
            '0.4',
            '0.001',
            '0.05',
        ],
        rightAnswer: 4
    },
    {
        question: 'f(x) функциясы кестелік мәндермен берілген: x0=1; x1=2; x2=3; y0=-1; y1=1; y2=5. x0, x1, x2 түйіндік нүктелеріндегі F(x) және f(x) мәндерінің сәйкестігі – міндетті шартты орындай отырып, F(x) жуықтау функциясын құру үшін түрдің көпмүшесін қолдана отырып интерполяциялау процедурасы қолданылды: ' + '<img src="qst8.png" class="longf">' + 'Содан кейін x=1,5 үшін функцияның мәні',
        options: [
            '-2,275',
            '-0,25',
            '1,75',
            '0,25',
            '20',
        ],
        rightAnswer: 1
    },
    {
        question: 'Кестелік мәндермен берілген f(x) функциясына жақын F функциясының аналитикалық өрнегін құру процедурасы үшін: ' + '<img src="qst9.png" class="longf">' + 'Өрнек түрлендірілгеннен кейін және ұқсас келтірілгеннен кейін көпмүшенің жоғары дәрежесі тең болады',
        options: [
            '2',
            '4',
            '3',
            '0',
            '2,5',
        ],
        rightAnswer: 0
    },
    {
        question: 'Зейдель әдісінің артықшылығы –',
        options: [
            'Жылдам конвергенцияны қамтамасыз етеді (әдетте)',
            'Сызықтық теңдеулер жүйесін шешуге жуықтау санын алдын-ала есептеуге мүмкіндік береді',
            'Сызықтық теңдеулер жүйесін алдын-ала түрлендіруді қажет етпейді',
            'Қарапайым итерация әдісінің үш метрикасының кез келгенін таңдауға мүмкіндік береді',
            'Қадамдардың шектеулі саны үшін теңдеулер жүйесінің нақты шешімін анықтайды',
        ],
        rightAnswer: 0
    },
    {
        question: 'Теңдеулер жүйесін шешу үшін бұл жүйені итерациялық түрге түрлендіру жүзеге асырылды:' + '<img src="qst11.png" class="sistems">' + 'Конвергенцияны тексеру кез-келген метриканы таңдау қайталанатын тізбектің конвергенциясына кепілдік беретіндігін көрсетті. Егер бастапқы жуықтау ретінде қабылданса x1=0, x2=0, x3=0, онда екінші жуықтау келесідей болады',
        options: [
            'x1 = -1, x2 = -1, x3 = -1',
            'x1 = 1, x2 = 1, x3 = 1,2',
            'x1 = 1, x2 = 1, x3 = 1',
            'x1 = -1, x2 = -1, x3 = -1,2',
            'x1 = -1, x2 = -1, x3 = 1,2',
        ],
        rightAnswer: 3
    },
    {
        question: 'F(x)=0 теңдеуінің сандық шешімі үшін eps=0.01 дәлдігі қарапайым Итерация әдісімен таңдалады. Конвергенция шарттарын тексеру нәтижесінде q=0.2 нақты саны алынды. Содан кейін есептеулерді тоқтату критерийі итерациялық реттілікке сәйкес келеді',
        options: [
            '0.5, 0.2, 0.01',
            '0.1, 0.3, 0.6',
            '0.09, 0.03, 0.01',
            '0.2, 0.1, 0.03',
            '0.01, 0.07, 0.15',
        ],
        rightAnswer: 2
    },
    {
        question: 'F(x)=0 теңдеуін шешудің кең таралған сандық әдістерінің бірі',
        options: [
            'Симпсон Әдісі',
            'Ең кіші квадраттар әдісі',
            'Қарапайым Итерация әдісі',
            'Рунге-Кутта Әдісі',
            'Симплекс әдісі',
        ],
        rightAnswer: 2
    },
    {
        question: 'x=(x1,x2,…,xn) және y=(y1,y2,…,yn) сызықтық теңдеулер жүйесіне негізделген итерациялық тізбектің екі жуықтауы болсын. Қарапайым Итерация әдісін келесі көрсеткіштердің бірімен сызықтық теңдеулер жүйесінде қарастыруға болады',
        options: [
            '<img src="ans14.1.png" class="func">',
            '<img src="ans14.4.png" class="func">',
            '<img src="ans14.3.png" class="func">',
            '<img src="ans14.2.png" class="func">',
            '<img src="ans14.5.png" class="func">',
        ],
        rightAnswer: 3
    },
    {
        question: 'Сызықтық теңдеулер жүйесін шешудің итерациялық әдістеріне мыналар жатады',
        options: [
            'Гаусс әдісімен',
            'Зейдель әдісі',
            'Рунг-кутта әдісімен',
            'Крамер әдісі',
            'Ортогонализация әдісі',
        ],
        rightAnswer: 1
    },
    {
        question: 'Теңдеулер жүйесін қарапайым Итерация әдісімен шешкен кезде түрдің теңдіктері құрылады: ' + '<img="qst16.png" class="sistems">' + 'Конвергенцияны тексеру оң нәтиже берді. Егер бастапқы жуықтау келесідей болса: x1=0, x2=0, x3=0, онда екінші жуықтау болады',
        options: [
            'x1 = 0,1, x2 = 0,9, x3 = 0,3',
            'x1 = 1, x2 = -2, x3 = 2',
            'x1 = 0,78, x2 = -2, x3 = 2',
            'x1 = 1, x2 = -1,99, x3 = 2',
            'x1 = 0,78, x2 = -1,99, x3 = 0,3 ',
        ],
        rightAnswer: 4
    },
    {
        question: 'f(x) функциясы кесте түрінде берілген: x0=1; x1=2; x2=3; y0=-1; y1=1; y2=5. Міндетті шартты – x0, x1, x2 түйін нүктелеріндегі F(x) және f(X) мәндерінің сәйкестігін орындай отырып, F(x) жуықтау функциясын құру үшін түрдің көпмүшесін қолдана отырып интерполяциялау процедурасы қолданылды: ' + '<img src="qst17.png" class="longf">' + 'Содан кейін x=2,5 функциясының мәні',
        options: [
            '4,75',
            '-2,875',
            '59',
            '-0,25',
            '2,75',
        ],
        rightAnswer: 4
    },
    {
        question: 'Сызықтық теңдеулер жүйесі итеративті түрге ауыстырылды: ' + '<img src="qst18.png" class="sistems">' + 'Конвергенцияны тексеру барлық үш метрика итерациялық тізбектің конвергенциясына кепілдік беретіндігін көрсетті. Егер сіз бірінші метриканы таңдасаңыз, итерацияны тоқтату шарты үшін α параметрінің мәнін таңдауыңыз керек',
        options: [
            'α = 1',
            'α = 0,2',
            'α = 0,2005',
            'α = -0,2',
            'α = 0,11',
        ],
        rightAnswer: 1
    },
    {
        question: 'Матрица деградацияға ұшырамайды, егер',
        options: [
            'Матрица жолдарының саны бағандар санына тең және оның детерминанты нөлге тең емес',
            'Матрица жолдарының саны бағандар санынан үлкен және оның детерминанты нөлге тең',
            'Оның детерминанты бірлікке тең',
            'Матрица жолдарының саны бағандар санынан аз және оның детерминанты нөлге тең емес',
            'Матрица бағандарының саны жолдар санына тең, ал оның детерминанты нөлге тең',
        ],
        rightAnswer: 0
    },
    {
        question: 'x=(x1,x2,…,xn) және y=(y1,y2,…,yn) n – өлшемді кеңістіктің екі нүктесі болсын (сызықтық теңдеулер жүйесіне салынған итерациялық тізбектің екі жуықтауы). Қарапайым Итерация әдісін келесі көрсеткіштердің бірімен сызықтық теңдеулер жүйесінде қарастыруға болады',
        options: [
            '<img src="ans20.1.png" class="func">',
            '<img src="ans20.2.png" class="func">',
            '<img src="ans20.3.png" class="func">',
            '<img src="ans20.4.png" class="func">',
            '<img src="ans20.5.png" class="func">',
        ],
        rightAnswer: 0
    },
    {
        question: 'f(x) функциясы кестелік мәндермен берілген: x0=1; x1=2; x2=3; y0=2; y1=1; y2=6. Функцияның туындысын табу үшін Лагранж көпмүшесі түрдің эквивалентті түйіндері үшін салынған:',
        options: [
            '-3t^2-4t+2',
            't^2+2',
            '3t^2+4t+2',
            '3t^2-4t+2',
            '4t^2-4t+2',
        ],
        rightAnswer: 3
    },
    {
        question: 'Ньютон көпмүшесі тең шығатын түйіндері бар кестемен берілген f(x) функциясының туындысын табу үшін таңдалады. Егер туындыны есептеу қажет x аргументі түйін нүктелерінің біріне сәйкес келсе, онда t параметрі мәнді алады',
        options: [
            't= -x',
            't=h',
            't=0',
            't=x',
            't=x0',
        ],
        rightAnswer: 2
    },
    {
        question: 'f(x) функциясы кесте түрінде берілген: x0=1; x1=1,5; x2=2; y0=2; y1=1; y2=6. Функцияның интегралын табу үшін Симпсон формуласы қолданылады. Содан кейін интегралдың жуықталған мәні ' + '<img src="qst23.png" class="formula">' + 'тең',
        options: [
            '3,3',
            '9',
            '2',
            '2,5',
            '4',
        ],
        rightAnswer: 2
    },
    {
        question: 'f(x) функциясы кесте түрінде берілген: x0=1; x1=1,5; x2=2; x3=2,5; y0=2; y1=3; y2=6, y3=11. Осы функцияның туындысын табу үшін Ньютон көпмүшесі таңдалады. X=1 түйіндік нүктесінде туынды функцияның жуықталған мәнін есептеу үшін түрдің есептеу формуласын таңдау дұрыс',
        options: [
            '<img src="ans24.1.png" class="func">',
            '<img src="ans24.2.png" class="func">',
            '<img src="ans24.4.png" class="func">',
            '<img src="ans24.3.png" class="func">',
            '<img src="ans24.5.png" class="func">',
        ],
        rightAnswer: 3
    },
    {
        question: 'Кестелік мәндермен берілген функцияның мәнін есептеу үшін Ньютонның бірінші интерполяциялық формуласын практикалық қолдану кезінде (х аргументін өзгерту қадамы бірдей болған жағдайда, яғни h=const), формула бойынша есептелген t параметрін ұтымды түрде енгізіңіз',
        options: [
            '<img src="ans25.1.png" class="func">',
            '<img src="ans25.2.png" class="func">',
            '<img src="ans25.3.png" class="func">',
            '<img src="ans25.4.png" class="func">',
            '<img src="ans25.5.png" class="func">',
        ],
        rightAnswer: 1
    },
    {
        question: 'Кесте түрінде берілген функцияның интегралын сандық есептеу үшін Симпсон формуласын қолданудың міндетті шарты шарт болып табылады',
        options: [
            'Тең шығатын түйіндерден түзілген N сегменттерінің саны тақ болып табылады',
            'Тең шығатын түйіндерден түзілген N сегменттерінің саны 10-нан кем болмауы тиіс',
            'Тең тұрған түйіндік нүктелер саны 10-нан кем болмауы тиіс',
            'Тең шығатын түйін нүктелерінің саны жұп болуы керек',
            'Тең шығатын түйіндерден түзілген N сегменттерінің саны жұп болып табылады',
        ],
        rightAnswer: 4
    },
    {
        question: 'f(x) функциясы кесте түрінде берілген: x0=1; x1=1,5; x2=2; y0=2; y1=3; y2=6. Ньютон көпмүшесін қолдана отырып, осы функцияның туындысын табу үшін алдымен ақырлы айырмашылықтарды есептеу керек, олардың жоғарғы реті',
        options: [
            '0',
            '1',
            '4',
            '3',
            '2',
        ],
        rightAnswer: 4
    },
    {
        question: 'f(x) функциясы кесте түрінде берілген: x0=1; x1=2; x2=3; x3=4; y0=4; y1=1; y2=7; y3=8. Функцияның интегралын табу үшін Симпсон формуласы таңдалады. Таңдалған формуланы қолданудың міндетті шарты орындалғанын тексеріңіз. Оң жағдайда Симпсонның квадратуралық формуласын пайдаланып интегралдың мәнін есептеңіз',
        options: [
            '7',
            'Функцияның интегралын есептеу үшін Симпсон формуласын қолдануға болмайды',
            '20',
            '10',
            '14',
        ],
        rightAnswer: 1
    },
    {
        question: 'f(x) функциясы кесте түрінде берілген: x0=1; x1=1,5; x2=2; y0=2; y1=3; y2=6. X=1,1 аргументі үшін осы функцияның туындысын табу үшін түрдің тең шығатын түйіндері үшін Лагранж көпмүшесі салынды: содан кейін функцияның туынды мәні',
        options: [
            '0.4',
            '3.21',
            '1.6',
            '0.2',
            '2.2',
        ],
        rightAnswer: 0
    },
    {
        question: 'f(x) функциясы кесте түрінде берілген: x0=1; x1=1,5; x2=2; y0=2; y1=1; y2=6. Осы функцияның туындысын табу үшін Ньютон көпмүшесі таңдалады. X=1 түйіндік нүктесінде туынды функцияның жуықталған мәнін есептеу үшін түрдің есептеу формуласын таңдау дұрыс',
        options: [
            '<img src="ans30.3.png" class="func">',
            '<img src="ans30.1.png" class="func">',
            '<img src="ans30.2.png" class="func">',
            '<img src="ans30.5.png" class="func">',
            '<img src="ans30.4.png" class="func">',
        ],
        rightAnswer: 0
    },
    {
        question: 'Теңдеудің түбірлерін сандық табу мәселесі екі кезеңнен тұрады. Бірінші кезеңде орындау керек',
        options: [
            'Теңдеудің аналитикалық шешімі',
            'Әрбір шағын ауданда берілген дәлдікпен түбірді табу',
            'Белгілі бір ауданда берілген дәлдікпен тамырларды есептеу',
            'Тамырларды бөлу',
            'Тамырларды нақтылау',
        ],
        rightAnswer: 3
    },
    {
        question: 'А квадрат матрицасы симметриялы деп аталады, егер',
        options: [
            'А матрицасы дегенеративті',
            'Матрицаның детерминанты нөлге тең',
            'А матрицасы оған транспозицияланғанға тең',
            'А матрицасы оның кері мәніне тең',
            'А матрицасы симметриялы',
        ],
        rightAnswer: 2
    },
    {
        question: 'Cызықтық теңдеулер жүйесін қарапайым Итерация әдісімен шешу жүйенің келесі итерациялық түрге ауысуына әкеледі:' + '<img src="qst33.png" class="sistems">' + 'Конвергенция шарты орындалғанын тексеріңіз. Оң жауаппен α параметрін есептеңіз',
        options: [
            'конвергенция шарттарының ешқайсысы орындалмайды',
            'α = 1',
            'α ≈ 0,91',
            'α = 0,02',
            'α ≈ 0,11',
        ],
        rightAnswer: 2
    },
    {
        question: 'Сызықтық теңдеулер жүйесі келесідей: ' + '<img src="qst34.png" class="formula">' + 'Сызықтық теңдеулер жүйесін ортогонализация әдісімен шешу үшін жүйеден алынған мәліметтерге негізделген векторлар базасы құрылды. Содан кейін базистің екінші векторы келесідей болады',
        options: [
            '(2; 2; -4)',
            '(0; 0; 1)',
            '(1; -2; -4)',
            '(1; -2; 4)',
            '(2; 2; 4)',
        ],
        rightAnswer: 3
    },
    {
        question: 'f(x) функциясы кестелік мәндермен берілсін: x0=1; x1=2; x2=3; y0=-1; y1=1; y2=5. Ньютонның интерполяциялық көпмүшесін құру үшін алдымен ақырлы айырмашылықтар кестесін құру қажет. Сонда мұндай кестенің аға реті тең болады',
        options: [
            '1',
            '2 ',
            '4',
            '0',
            '3',
        ],
        rightAnswer: 1
    },
    {
        question: 'Метрика болып табылатын ρ(x,y) функциясы үшін төрт шарт орындалуы керек, олардың бірі',
        options: [
            'кез келген x және y кезінде ρ(x,y)>0 мәні',
            'ρ(x,y)= - ρ(y,x) кез келген x және y кезіндегі шегі',
            'ρ(x,y)=0 кез келген x және y',
            'кез келген x және y кезінде ρ(x,y)<0',
            'ρ(x,y)=ρ(y,x) кез келген x және y',
        ],
        rightAnswer: 4
    },
    {
        question: 'ρ(x,y) функциясы метрика ретінде қабылдануы мүмкін, егер төрт шарт орындалса, олардың бірі',
        options: [
            'кез-келген x және y кезінде ρ(x,y)>0 мәні',
            'кез келген x және y кезінде ρ(x,y)<0',
            'кез келген x және y кезінде ρ(x,y)=-ρ(y,x)',
            'кез келген x және y кезінде ρ(x,y)=0 мән',
            'өрнек ρ(x,y)=0, егер x=y болса ғана',
        ],
        rightAnswer: 4
    },
    {
        question: 'f(x) функциясы кесте түрінде берілген: x0=1; x1=2; x2=3; y0=1; y1=5; y2=11. Түйін нүктелерінің ешқайсысына сәйкес келмейтін x аргументінің функциясының мәнін табу үшін интерполяциялық көпмүше салынды. Көпмүшелердің қайсысы интерполяция процедурасының нәтижесі екенін анықтаңыз',
        options: [
            'F(x) = x2 +x +1',
            'F(x) = x2 +x -1',
            'F(x) = x2 -x +1',
            'F(x) = -x2 -x +2',
            'F(x) = x2 +1',
        ],
        rightAnswer: 1
    },
    {
        question: 'Итерациялық процестің конвергенциясының жеткілікті шарты келесідей: ' + '<img src="qst39.png" class="alpha">' + 'одан кейін итерациялық процесті тоқтату шарты үшін қолданылатын метрика ретінде таңдау керек',
        options: [
            '<img src="ans39.4.png" class="longf">',
            '<img src="ans39.1.png" class="longf">',
            '<img src="ans39.6.png" class="longf">',
            '<img src="ans39.3.png" class="longf">',
            '<img src="ans39.2.png" class="longf">',
        ],
        rightAnswer: 0
    },
    {
        question: 'Сызықтық теңдеулер жүйесі келесідей: ' + '<img src="qst40.png" class="formula">' + 'Сызықтық теңдеулер жүйесін ортогонализация әдісімен шешу үшін жүйеден алынған мәліметтерге негізделген векторлар базасы құрылды. Содан кейін бірінші вектор келесідей болады',
        options: [
            '(2; 2; -4)',
            '(1; -2; -4)',
            '(1; -2; 4)',
            '(0; 0; 1)',
            '(2; 2; 4)',
        ],
        rightAnswer: 0
    },
    {
        question: 'Сызықтық теңдеулер жүйесі белгісіз коэффициенттер матрицасы келесідей: ' + '<img src="qst41.png" src="formula">' + 'Жүйе теңдіктерінің оң жағы B = (3;-1) векторымен ұсынылған. Жүйені Зейдель әдісімен шешу үшін оң жағы «қалыпты» түрге ауыстырылды. Содан кейін түрлендірілген теңдеулер жүйесінің оң жағы векторды құрайды',
        options: [
            '(1; 11)',
            '(1; 11)',
            '(8; 2)',
            '(2; 8)',
            '(2; -8)',
        ],
        rightAnswer: 3
    },
    {
        question: 'Кестелік мәндермен берілген функцияны интерполяциялау үшін түрдің көпмүшесі салынды: ' + '<img src="qst42.png" class="longf">' + 'Содан кейін кестедегі n түйін нүктелерінің саны',
        options: [
            '4',
            '6',
            '3',
            '1',
            '2',
        ],
        rightAnswer: 2
    },
    {
        question: 'Кестелік мәндермен берілген f(x) функциясына жақын F функциясының аналитикалық өрнегін құру процедурасы үшін түрдің көпмүшесі салынды:' + '<img src="qst43.png" class="longf">' + 'Мұндай көпмүше деп аталады',
        options: [
            'Симпсон көпмүшесі',
            'Көпмүшелік рунге-кутта',
            'Лагранж көпмүшесі',
            'Эйлер көпмүшесі',
            'Ньютон көпмүшесі',
        ],
        rightAnswer: 2
    },
    {
        question: 'Сызықтық теңдеулер жүйесінің сандық шешімімен алдыңғы жуықтау келесідей болсын: x1, x2, …, xn, ал келесі жуықтау сәйкесінше y1, y2, …, yn. Yi айнымалысының мәнін есептеу кезінде алынған y1, y2, …, yi-1 мәндері ескерілетін әдіс',
        options: [
            'Симпсон әдісі',
            'Трапеция әдісі',
            'Ортогонализация әдісі',
            'Зейдель әдісі',
            'Қарапайым итерация әдісі',
        ],
        rightAnswer: 3
    },
    {
        question: 'F(x)=0 теңдеуінің сандық шешімі үшін бұл теңдеуді x=f(x) эквивалентімен ауыстыру орындалды. n=0,1,2,… үшін xn=f(xn-1) қатынасын қолдана отырып, біз деп аталатын сандық тізбекті аламыз',
        options: [
            'Жарамсыз жуықтаулар тізімі',
            'Итерациялық реттілік',
            'Рұқсат етілген жуықтаулар жиыны',
            'Теңдеудің көптеген мүмкін шешімдері',
            'Теңдеу шешімдерінің кортежі',
        ],
        rightAnswer: 1
    },
    {
        question: 'Теңдеулердің қайсысын 2x-sin(x)=0 теңдеуіне тең деп санауға болады',
        options: [
            'x=sin(x)-2',
            'x=sin(x)',
            'x=-2sin(x)',
            'sin(2x)=0',
            'x=sin(x)-x',
        ],
        rightAnswer: 4
    },
    {
        question: 'f(x)# функциясының аналитикалық өрнегі белгісіз болсын, бірақ оның мәндерінің кестесі түйін нүктелерінде көрсетілген. F(x) функциясын құру үшін Көпмүшелерді құруға негізделген арнайы әдістер қолданылады. Бұл x1, x2 ,….xn түйін нүктелеріндегі f(x) және F(x) мәндерінің дәл сәйкестігін талап етеді. Бұл түйін нүктелері деп аталады',
        options: [
            'Функцияның экстремалды нүктелері',
            'Теңдеудің түбірлері',
            'Көпмүшелік түйіндері',
            'Теңдеулер жүйесінің түбірлері',
            'Интерполяция түйіндері',
        ],
        rightAnswer: 4
    },
    {
        question: 'F(x)=0 теңдеуінің түбірлерін жартылай бөлу әдісімен нақтылау нәтижесінде түбірі бар [0.35, 0.45] өте аз көршілестік алынды. Сонда теңдеудің түбірін шамамен алынған мән деп санауға болады',
        options: [
            '0.355',
            '0.4',
            '0.445',
            '0.05',
            '0.9',
        ],
        rightAnswer: 1
    },
    {
        question: 'x=(x1,x2,…,xn) және y=(y1,y2,…,yn) n – өлшемді кеңістіктің екі нүктесі болсын (сызықтық теңдеулер жүйесіне салынған итерациялық тізбектің екі жуықтауы). Қарапайым Итерация әдісін практикалық қолдану кезінде келесі көрсеткіштердің бірі бар кеңістіктегі сызықтық теңдеулер жүйесін қарастыруға болады',
        options: [
            '<img src="ans49.5.png" class="forp">',
            '<img src="ans49.4.png" class="forp">',
            '<img src="ans49.3.png" class="forp">',
            '<img src="ans49.2.png" class="forp">',
            '<img src="ans49.1.png" class="forp">',
        ],
        rightAnswer: 0
    },
    {
        question: 'Интерполяциялық көпмүшені құру үшін Ньютон көпмүшесі таңдалды. Бұл процедура ақырлы айырмашылықтар кестесін алдын-ала құруды талап етеді. Формулалардың қайсысы ақырлы айырмашылықтарды есептеу процедурасын дұрыс анықтайтынын анықтаңыз.',
        options: [
            '<img src="ans50.5.png" class="fory">',
            '<img src="ans50.4.png" class="fory">',
            '<img src="ans50.3.png" class="fory">',
            '<img src="ans50.2.png" class="fory">',
            '<img src="ans50.1.png" class="fory">',
        ],
        rightAnswer: 0
    },
    {
        question: 'f(x) функциясы [a,b] сегментінде a=x0, x1, …, xn=b тең ұзындықтағы түйіндерде берілсін, олардың сегменті n тең бөліктерге бөлінеді. Бұл жағдайда интерполяция қадамын формула бойынша есептеуге болады',
        options: [
            '<img src="ans51.5.png" class="formula">',
            '<img src="ans51.4.png" class="formula">',
            '<img src="ans51.3.png" class="formula">',
            '<img src="ans51.1.png" class="formula">',
            '<img src="ans51.2.png" class="formula">',
        ],
        rightAnswer: 3
    },
    {
        question: 'Функция кестелік мәндермен берілген (x1,y1), (x2,y2), … (xn,yn). x1,x2,…,xn нүктелерінде y1,y2,…,yn кестелік мәндеріне мүмкіндігінше жақын мәндерді қабылдайтын y=F(x) жуықтау функциясын құру қажет (түйін нүктелеріндегі мәндердің міндетті сәйкестік шартын орындау қажет емес). Содан кейін y=F(x) теңдеуі аталады',
        options: [
            'Рунге-Кутта формуласымен',
            'Эйлер формуласы',
            'Эмпирикалық формула',
            'Трапеция формуласы',
            'Симпсон формуласы',
        ],
        rightAnswer: 2
    },
    {
        question: 'Функция көрініс кестесімен ұсынылған: (x1,y1), (x2,y2), … (xn,yn). x1,x2,…,xn кестесінің түйіндік нүктелерінде y1,y2,…,yn мәндеріне мүмкіндігінше жақын мәндерді қабылдайтын y=F(x) жуықтау функциясын құру қажет (түйін нүктелеріндегі мәндердің міндетті сәйкестік шартын орындау қажет емес). Содан кейін y=F(x) формуласы деп аталады',
        options: [
            'Рунге-кутта формуласымен',
            'Эйлер формуласы',
            'Регрессия теңдеуі',
            'Симпсон формуласы',
            'Трапеция формуласы',
        ],
        rightAnswer: 2
    },
    {
        question: 'Дифференциалдық теңдеулерді шешу әдістері кестеде көрсетілген функция түрінде жуықтау шешімін береді, топқа жатады',
        options: [
            'Сандық интеграция әдістері',
            'Графикалық әдістер',
            'Сандық саралау әдістері',
            'Сандық әдістер',
            'Аналитикалық әдістер',
        ],
        rightAnswer: 3
    },
    {
        question: 'Кестеде көрсетілген функцияның туындысын табу үшін Лагранж көпмүшесі түрдің тең шығатын түйіндерімен салынған:' + '<img src="qst55.png" class="longf">' + 'Сонда өрнек жеңілдетілгеннен кейін көпмүшенің жоғарғы дәрежесі тең болады',
        options: [
            '4',
            '2',
            '0',
            '1',
            '3',
        ],
        rightAnswer: 1
    },
    {
        question: 'f(x) функциясы кесте түрінде берілген: x0=1; x1=2; x2=3; y0=4; y1=1; y2=6. Осы функцияның туындысын табу үшін Ньютон көпмүшесі таңдалады. Содан кейін x=1 түйін нүктесіндегі туынды функцияның жуықталған мәні ',
        options: [
            '-14',
            '-8',
            '-3,5',
            '7',
            '-7',
        ],
        rightAnswer: 4
    },
    {
        question: 'f(x) функциясы [-1,4] сегментінде x0 =-1, x1, x2, x3=2,75, x4=4 түйін нүктелеріндегі мәндерімен анықталады. Содан кейін бірінші және екінші түйін нүктелері сәйкесінше тең болады',
        options: [
            '1,5; 2,75',
            '0; 1,5',
            '2,75; 4',
            '-1; 1,5',
            '0,25; 1,5',
        ],
        rightAnswer: 4
    },
    {
        question: 'f(x) функциясы кесте түрінде берілсін (x1,y1), (x2,y2), … (xn,yn). x1,x2,…,xn түйіндік нүктелеріндегі мәндері кестеге ең жақын болатын белгілі бір түрдің F(x) жуықтау функциясын таңдау процесі тапсырма деп аталады',
        options: [
            'Эйлер әдісімен дифференциалдық теңдеудің шешімдері',
            'Функцияны ең кіші квадраттар әдісімен жуықтау',
            'Сандық саралау',
            'Сандық интеграция',
            'Функцияның ең үлкен квадраттар әдісімен жуықтауы',
        ],
        rightAnswer: 1
    },
    {
        question: 'f(x) функциясы кесте түрінде берілген: x0=1; x1=1,5; x2=2; y0=2; y1=1; y2=6. Осы функцияның туындысын табу үшін Ньютон көпмүшесі таңдалады. Содан кейін x=1 түйін нүктесіндегі туынды функцияның жуықталған мәні',
        options: [
            '1',
            '-8',
            '-1',
            '-4',
            '8',
        ],
        rightAnswer: 0
    },
    {
        question: 'График түрінде шамамен шешім беретін дифференциалдық теңдеулерді шешу әдістері топқа жатады',
        options: [
            'Графикалық әдістер',
            'Сандық әдістер',
            'Сандық интеграция әдістері',
            'Аналитикалық әдістер',
            'Сандық саралау әдістері',
        ],
        rightAnswer: 0
    },
    {
        question: 'f(x) функциясы кестелік мәндермен берілген: x0=1; x1=2; x2=3; y0=2; y1=1; y2=6. Функцияның туындысын табу үшін түрдің тең шығатын түйіндері үшін Лагранж көпмүшесі салынды: ' + '<img src="qst61.png" class="longf">' + 'Содан кейін x=1,5 үшін функцияның туынды мәні',
        options: [
            '0,75',
            '0,2',
            '2,75',
            '-1',
            '5',
        ],
        rightAnswer: 3
    },
    {
        question: 'f(x) функциясы кестелік мәндермен берілген: x0=1; x1=2; x2=3; y0=2; y1=1; y2=6. Функцияның туындысын табу үшін түрдің тең шығатын түйіндері үшін Лагранж көпмүшесі салынды: ' + '<img src="qst62.png" class="longf">' + 'Содан кейін функцияның туындысының өрнегі келесідей болады',
        options: [
            't^2+2',
            '6t',
            '6t-4',
            '3t^2-4t+2',
            '2t',
        ],
        rightAnswer: 2
    },
    {
        question: 'f(x) функциясы [-1,1] сегментінде түйін нүктелеріндегі мәндерімен берілген. Интерполяция қадамы 0,2 екені белгілі. Содан кейін интерполяция сегменттерінің саны n',
        options: [
            '5',
            '11',
            '10',
            '12',
            '9',
        ],
        rightAnswer: 2
    },
    {
        question: 'f(x) функциясының интегралын есептеу кезінде, бұл процедураны аналитикалық түрде орындау қиын немесе мүмкін болмаған жағдайда, шамамен есептеу формулалары қолданылады. Бұл формулалар',
        options: [
            'Лейбниц формулалары',
            'Интерполяция формулалары',
            'Ең кіші квадраттардың формулалары',
            'Квадратуралық формулалар',
            'Сандық дифференциалдау формулаларымен',
        ],
        rightAnswer: 3
    },
    {
        question: 'Кесте бойынша берілген f(x) функциясының интегралын шамамен есептеу үшін формула таңдалады ' + '<img src="qst65.png" class="longf">' + 'Содан кейін h параметрі формула бойынша есептеледі',
        options: [
            '<img src="ans65.2.png" class="formula">',
            '<img src="ans65.1.png" class="formula">',
            '<img src="ans65.3.png" class="formula">',
            '<img src="ans65.4.png" class="formula">',
            '<img src="ans65.5.png" class="formula">',
        ],
        rightAnswer: 1
    },
    {
        question: 'f(x) функциясы кестелік мәндермен берілген: x0=1; x1=2; x2=3; y0=2; y1=1; y2=6. Функцияның туындысын табу үшін түрдің тең шығатын түйіндері үшін Лагранж көпмүшесі салынды: ' + '<img src="qst66.png" class="longf">' + 'Бұл өрнекте t параметрі',
        options: [
            't=0,5',
            't=2*(x-2)',
            't=x-2',
            't=x-1',
            't=2*(x-1)',
        ],
        rightAnswer: 4
    },
    {
        question: 'Берілген кесте функциясы үшін F(x) жуықтау функциясын құру f(x) (түйін нүктелеріндегі F(x) және f(x) мәндерінің сәйкес келуінің міндетті шартымен) егер x аргументі тең мәндерге ие болса, жүзеге асырылады. Содан кейін көршілес интерполяция түйіндерінде алынған бірінші ретті ақырлы айырмашылықтардан алынған айырмашылықтар деп аталады',
        options: [
            'Тең шығатын интерполяция түйіндері',
            'Функция аргументін өзгерту қадамы',
            'Интерполяцияның түйіндік нүктелері',
            'Бірінші ретті ақырлы айырмашылықтар',
            'Екінші ретті ақырлы айырмашылықтар',
        ],
        rightAnswer: 4
    },
    {
        question: 'Сызықтық теңдеулер жүйесі Зайдель әдісімен шешу үшін "қалыпты" түрге ауыстырылды. Түрлендіру нәтижесінде коэффициент матрицасы келесідей болады: ' + '<img src="qst68.png" class="formula">' + 'Түрлендірілген теңдеулер жүйесінің оң жағы векторды құрайды (4; 16). Содан кейін сызықтық теңдеулер жүйесін Зейдель әдісімен сандық шешу үшін екінші өрнек келесідей болады',
        options: [
            '<img src="ans68.1.png" class="fory">',
            '<img src="ans68.4.png" class="fory">',
            '<img src="ans68.2.png" class="fory">',
            '<img src="ans68.3.png" class="fory">',
            '<img src="ans68.5.png" class="fory">',
        ],
        rightAnswer: 1
    },
    {
        question: 'Сызықтық теңдеулер жүйесін шешу үшін ' + '<img src="qst69.png" class="forp">' + 'мет метрикасында итерациялық реттілік құрылды. Сонда мұндай реттіліктің конвергенциясының жеткілікті шарты',
        options: [
            '<img src="ans69.2.png" class="alpha">',
            '<img src="ans69.1.png" class="alpha">',
            '<img src="ans69.3.png" class="alpha">',
            'Сызықтық теңдеулер жүйесінің оң жағында белгісіз барлық коэффициенттердің квадраттарының қосындысы біреуден аз болуы керек',
            'Сызықтық теңдеулер жүйесінің оң жағында белгісіз барлық коэффициенттердің квадраттарының қосындысы бірлікке тең болуы керек',
        ],
        rightAnswer: 0
    },
    {
        question: 'Сызықтық емес теңдеу берілсін F(x)=0. Бұл жағдайда F(x) функциясы [a,b] интервалында анықталады және үздіксіз болады. Сызықтық емес F(x) функциясын нөлге айналдыратын кез келген t∈[a,b] деп аталады',
        options: [
            'Теңдеудің түбірі',
            'Трансценденттік теңдеу',
            'Теңдеудің абсолютті нөлі',
            'Эквивалентті теңдеу',
            'Тамырларды бөлу арқылы',
        ],
        rightAnswer: 0
    },
    {
        question: 'Интерполяциялық көпмүшені құру процедурасын жүргізу кезінде Ньютон көпмүшесі таңдалды. Бұл жағдайда алдымен ақырлы айырмашылықтар кестесін құру қажет. Формулалардың қайсысы ақырлы айырмашылықтарды есептеу процедурасын дұрыс анықтайтынын анықтаңыз.',
        options: [
            'yi-1 – yi',
            'yi - yi+1',
            'xi+1 – xi',
            'yi+1 – yi',
            'xi+1 – yi',
        ],
        rightAnswer: 3
    },
    {
        question: 'Сызықтық емес теңдеу берілсін F(x)=0. Бұл жағдайда F(x) функциясы [a,b] интервалында анықталады және үздіксіз болады. Егер F(x) сызықтық емес функциясын ғана емес, оның туындыларын (k-1) ретіне дейін нөлге айналдыратын t∈[a,b] саны болса, онда мұндай t саны аталады',
        options: [
            'Теңдеудің трансценденттік түбірі',
            'Теңдеудің қарапайым түбірі',
            'k-ші еселік теңдеуінің түбірі',
            'Теңдеудің алгебралық түбірі',
            'Эквивалентті теңдеу',
        ],
        rightAnswer: 2
    },
    {
        question: 'F(x)=0 теңдеуінің түбірлерін бөлу процедурасын орындау үшін график құруды жеңілдету үшін f(x)=g(x) эквивалентті теңдеуіне көшу жүзеге асырылды. Нәтижесінде теңдеудің барлық түбірлерін қамтитын [A,B] сегменті алынды. Теңдеудің дәл бір түбірін қамтитын a,b]⊂[A,B] табу шартымен түбірді бөлу кезеңін бағдарламалық түрде жүзеге асыруда мыналарды көрсетуге болады',
        options: [
            'F(a)*F(b)>0',
            'F(a)/F(b)<0',
            'F(a)*F(b)<0',
            'F(a)+F(b)=0',
            'F(a)-F(b)=0',
        ],
        rightAnswer: 2
    },
    {
        question: 'F(x) және G(x) екі теңдеуі эквивалент деп аталады, егер ',
        options: [
            'Кем дегенде бір теңдеу алгебралық болып табылады және олардың шешімдерінің жиынтығында кем дегенде бір ортақ элемент болады',
            'Бірінші теңдеудің кем дегенде бір шешімі екінші теңдеудің шешімі болып табылады',
            'Осы теңдеулердің әрқайсысында көптеген шешімдер бар',
            'Осы теңдеулердің шешімдерінің жиынтығы сәйкес келеді',
            'Екі теңдеу де трансценденталды және осы теңдеулердің k-ші еселігінің шешімдерінің жиынтығы қиылыспайды',
        ],
        rightAnswer: 3
    },
    {
        question: 'ρ(x,y) функциясы төрт шарт орындалса, метрика деп аталады, олардың бірі',
        options: [
            'кез келген x және y кезінде ρ(x,y)=0',
            'кез-келген x және y кезінде ρ(x,y)≥0',
            'кез келген x және y кезінде ρ(x,y)<0',
            'кез-келген x және y кезінде ρ(x,y)>0',
            'кез келген x және y кезінде ρ(x,y)=-ρ(y,x)',
        ],
        rightAnswer: 1
    },
    {
        question: 'f(x) функциясы кестелік мәндермен берілген: x0=1; x1=2; x2=3; y0=1; y1=3; y2=7. Түйін нүктелерінің ешқайсысына сәйкес келмейтін x аргументінің функциясының мәнін табу үшін интерполяциялық көпмүше салынды. Көпмүшелердің қайсысы интерполяция процедурасының нәтижесі екенін анықтаңыз',
        options: [
            'F(x) = x2 +x -2',
            'F(x) = x2 +x -1',
            'F(x) = x2 -x -1',
            'F(x) = x2 +1',
            'F(x) = x2 -x +1',
        ],
        rightAnswer: 4
    },
    {
        question: 'Сызықтық теңдеулер жүйесін шешу үшін эквивалентті теңдіктер құрылады:' + '<img src="qst77.png" class="sistems">' + 'Конвергенцияны тексеру оң нәтиже берді. Бастапқы жуықтау келесідей болады: x1=0, x2=0, x3=0. Содан кейін бірінші жуықтау',
        options: [
            'x1 = 1, x2 = 1, x3 = 1',
            'x1 = 1, x2 = 2, x3 = 2',
            'x1 = -1, x2 = 2, x3 = -2',
            'x1 = -1, x2 = -2, x3 = -2',
            'x1 = 1, x2 = -2, x3 = 2',
        ],
        rightAnswer: 4
    },
    {
        question: 'Теңдеудің түбірлерін сандық табу мәселесі екі кезеңнен тұрады. Екінші кезеңде орындау керек',
        options: [
            'Тамырларды бөлу',
            'Белгілі бір ауданда берілген дәлдікпен тамырларды есептеу',
            'Теңдеудің барлық түбірлері орналасқан сандық сызықтағы аймақты табу',
            'Теңдеудің аналитикалық шешімі',
            'Қарастырылып отырған аймақтың бір түбір мәні бар жеткілікті шағын аудандарын табу',
        ],
        rightAnswer: 1
    },
    {
        question: '[a,b] сегментіндегі F(x)=0 теңдеуінің сандық шешімін жартылай бөлу әдісін бағдарламалық түрде жүзеге асыруда c=(a+b)/2 ортасы табылды. Егер F(a)*F(c)<0 шарты дұрыс болса, онда пәрменді орындау керек (C++ синтаксис)',
        options: [
            'b=c',
            'a=c',
            'a=b',
            'c=a',
            'c=b',
        ],
        rightAnswer: 0
    },
    {
        question: 'Сызықтық теңдеулер жүйесі Зайдель әдісімен шешу үшін «қалыпты» түрге ауыстырылды. Түрлендіру нәтижесінде коэффициент матрицасы келесідей болады: ' + '<img src="qst80.png" class="formula">' + 'Түрлендірілген теңдеулер жүйесінің оң жағы (4; 16). Содан кейін сызықтық теңдеулер жүйесін Зейдель әдісімен сандық шешу үшін бірінші өрнек келесідей болады',
        options: [
            '<img src="ans80.2.png" class="fory">',
            '<img src="ans80.1.png" class="fory">',
            '<img src="ans80.3.png" class="fory">',
            '<img src="ans80.4.png" class="fory">',
            '<img src="ans80.5.png" class="fory">',
        ],
        rightAnswer: 0
    },
    {
        question: 'Берілген теңдеулердің қайсысы трансценденталды екенін көрсетіңіз',
        options: [
            'y+4=0',
            '5x+1=0',
            'x-3=0',
            'x-sin(x)=2',
            '-6z+1=0',
        ],
        rightAnswer: 3
    },
    {
        question: 'Сызықтық теңдеулер жүйесін Сейдель әдісімен шешкен кезде жүйені матрицалық түрде ұсынды: A·X=B. жүйені итерациялық тізбектің конвергенциясына кепілдік беретін түрге түрлендіру үшін әрекетті орындау қажет',
        options: [
            'AT·A·X=A·B',
            'A·A·X=A·B',
            'AT·A·X=AT·B',
            'A·AT·X=B·AT',
            'A·AT·X=AT·B',
        ],
        rightAnswer: 2
    },
    {
        question: 'Сызықтық теңдеулер жүйесін шешуде ' + '<img src="qst83.png" class="forp">' + 'метрикасын қолдана отырып, итерациялық реттілік құрылады . Бұл жағдайда тізбектің конвергенциясының жеткілікті шарты келесідей тұжырымдалады …',
        options: [
            '<img src="ans83.1.png" class="alpha">',
            '<img src="ans83.2.png" class="alpha">',
            '<img src="ans83.3.png" class="alpha">',
            'Сызықтық теңдеулер жүйесінің оң жағында белгісіз барлық коэффициенттердің квадраттарының қосындысы бірлікке тең болуы керек',
            'Сызықтық теңдеулер жүйесінің оң жағында белгісіз барлық коэффициенттердің квадраттарының қосындысы біреуден аз болуы керек',
        ],
        rightAnswer: 2
    },
    {
        question: 'Сызықтық теңдеулер жүйесінің сандық шешімі мағынасы бар, егер',
        options: [
            'Жүйе коэффициенттері матрицасының детерминанты нөлге тең',
            'Жүйе коэффициенттерінің матрицасы квадрат болып табылады',
            'Жүйе коэффициенттерінің матрицасы сәйкес келмейді',
            'Жүйе коэффициенттері матрицасының детерминанты нөлге тең емес ',
            'Жүйе коэффициенттерінің матрицасы үшбұрышты',
        ],
        rightAnswer: 3
    },
    {
        question: 'Теңдеулер жүйесі келесідей болсын:' + '<img src="qst85.png" class="formula">' + 'Осы сызықтық теңдеулер жүйесін ортогонализация әдісімен шешу үшін жүйеден алынған мәліметтерге негізделген векторлар базасы құрылды. Содан кейін базистің үшінші векторы келесідей болады',
        options: [
            '(1; -2; -4)',
            '(0; 0; 1)',
            '(2; 2; 4)',
            '(2; 2; -4)',
            '(1; -2; 4)',
        ],
        rightAnswer: 1
    },
    {
        question: 'f(x) функциясының аналитикалық өрнегі белгісіз болсын, бірақ оның мәндерінің кестесі түйін нүктелерінде көрсетілген. Түйіндік нүктелердің ешқайсысына сәйкес келмейтін аргумент функциясының мәнін табу үшін арнайы әдіс қолданылады – f(x) функциясының бастапқы деректері бойынша құрылыс. Бұл x1, x2 ,…., xn түйін нүктелеріндегі f(x) және F(x) мәндерінің дәл сәйкестігін талап етеді. Шамамен функцияны табудың бұл әдісі деп аталады',
        options: [
            'Симпсон әдісімен',
            'Саралау арқылы',
            'Интеграциялау арқылы',
            'Рунге-кутта әдісімен',
            'Интерполяция арқылы',
        ],
        rightAnswer: 4
    },
    {
        question: 'Кесте түрінде берілген f(x) функциясының туындысын табу үшін Ньютон түрінің көпмүшесі таңдалады: ' + '<img src="qst87.png" class="func">' + 'Содан кейін f(x) функциясының түйіндік нүктелерінің саны',
        options: [
            '3',
            '5',
            '2',
            '1',
            '4',
        ],
        rightAnswer: 4
    },
    {
        question: 'f(x) функциясы [1,10] сегментінде x0, x1, x2, x3 түйін нүктелеріндегі мәндерімен берілген. Бұл жағдайда интерполяция қадамы',
        options: [
            '5,5',
            '3',
            '2,5',
            '-3',
            '2,25',
        ],
        rightAnswer: 1
    },
    {
        question: 'f(x) функциясы [1,2] сегментінде тең шығатын түйіндері бар кесте түрінде берілген. h интерполяциясының қадамы 0,25. Содан кейін интерполяция сегменттерінің саны n',
        options: [
            '4',
            '0',
            '10',
            '5',
            '0,25',
        ],
        rightAnswer: 0
    },
    {
        question: 'f(x) функциясы кесте түрінде берілген: x0=1; x1=1,5; x2=2; y0=2; y1=3; y2=6. Осы функцияның туындысын табу үшін түрдің тең тұрған түйіндері үшін Лагранж көпмүшесі салынды:',
        options: [
            't=2*(x-1)',
            't=2x',
            't=2*(x-2)',
            't=4*(x-1)',
            't=0,5*(x-1)',
        ],
        rightAnswer: 0
    },
    {
        question: 'f(x) функциясы кестелік мәндермен берілген: x0=1; x1=2; x2=3; y0=-1; y1=1; y2=5. Жуықтау функциясын құру үшін Ньютон көпмүшесі таңдалды. Алдын ала ақырлы айырмашылықтар кестесі жасалды. Бұл жағдайда ақырлы айырмашылық ' + '<img src="qst91.png">' + ' тең',
        options: [
            '0',
            '3',
            '4',
            '2',
            '1',
        ],
        rightAnswer: 3
    },
    {
        question: 'f(x) функциясы [0,10] сегментінде x0, x1, түйін нүктелеріндегі мәндерімен берілген. Бұл жағдайда интерполяция қадамы',
        options: [
            '-5',
            '2,5',
            '5',
            '3,3',
            '5,5',
        ],
        rightAnswer: 2
    },
    {
        question: 'f(x) функциясы [1,2] сегментінде бірдей шығатын түйіндері бар кесте түрінде анықталады. h интерполяциясының қадамы 0,25. Содан кейін кестедегі түйін нүктелерінің саны',
        options: [
            '10',
            '2',
            '5',
            '4',
            '1',
        ],
        rightAnswer: 2
    },
    {
        question: 'F(x) функциясы кестелік мәндермен берілсін: x0=1; x1=2; x2=3; y0=-1; y1=1; y2=5. Жуықтау функциясын құру үшін Ньютон көпмүшесі таңдалды. Алдын ала ақырлы айырмашылықтар кестесі жасалды. Бұл жағдайда ақырлы айырмашылықтар сәйкесінше ' +  '<img src="qst92.png">' + ' және ' + '<img src="qst92.1.png">' + 'тең болады',
        options: [
            '2; -4',
            '1; 1',
            '-2; -4',
            '2; 4',
            '2; 2',
        ],
        rightAnswer: 3
    },
    {
        question: 'Дәл бір шешімі бар сызықтық теңдеулер жүйесі деп аталады',
        options: [
            'Сызықтық теңдеулердің сәйкес келмейтін жүйесі',
            'Сызықтық теңдеулердің белгілі бір жүйесі',
            'Сызықтық теңдеулердің квадрат жүйесі',
            'Сызықтық теңдеулердің деградацияланбаған жүйесі',
            'Сызықтық теңдеулердің деградациялық жүйесі',
        ],
        rightAnswer: 1
    },
    {
        question: 'Кем дегенде бір шешімі бар сызықтық теңдеулер жүйесі деп аталады',
        options: [
            'Сызықтық теңдеулердің деградацияланбаған жүйесі',
            'Сызықтық теңдеулердің квадрат жүйесі',
            'Сызықтық теңдеулердің деградациялық жүйесі',
            'Сызықтық теңдеулердің сәйкес келмейтін жүйесі',
            'Сызықтық теңдеулердің бірлескен жүйесі',
        ],
        rightAnswer: 4
    },
    {
        question: 'f(x) функциясы кестелік мәндермен берілген: x0=1; x1=2; x2=3; y0=-1; y1=1; y2=5. x0, x1, x2 түйін нүктелеріндегі F(x) және f(x) мәндерінің сәйкестігі – міндетті шартты орындай отырып, F(x) жуықтау функциясын құру үшін түрдің көпмүшесі салынды' + '<img src="qst97.png" class="longf">' + 'Содан кейін көпмүшенің түрі болады',
        options: [
            'F(x) = x2 -1',
            'F(x) = x2 -2x -1',
            'F(x) = x2 +x -1',
            'F(x) = x2 -x +1',
            'F(x) = x2 -x -1',
        ],
        rightAnswer: 4
    },
    {
        question: 'F(x)=0 теңдеуінің түбірлерін жартылай бөлу әдісімен нақтылау нәтижесінде түбірі бар өте аз көршілестік алынды [α,β].Сонда жуықталған шешімнің қателігі мәннен аспайды',
        options: [
            'D=(β+α)/2',
            'D=(β-α)/2',
            'D=(β-α)*2',
            'D=(α+β)/2',
            'D=(β-α)',
        ],
        rightAnswer: 1
    },
    {
        question: 'Арифметикалық амалдардың шектеулі саны үшін сызықтық теңдеулер жүйесінің шешімін беретін әдістер',
        options: [
            'Тікелей әдістермен',
            'Жуықтау әдістерімен',
            'Итерациялық',
            'Симплекс әдістерімен',
            'Аккорд және тангенс әдістерімен',
        ],
        rightAnswer: 0
    },
    {
        question: 'Сызықтық теңдеулер жүйесін шешуге арналған итерациялық реттілік ' + '<img src="qst100.png" class="forp">' + 'метрикасына негізделген. Содан кейін тізбектің конвергенциясының жеткілікті шарты келесідей тұжырымдалады…',
        options: [
            '<img src="ans100.1.png" class="alpha">',
            '<img src="ans100.2.png" class="alpha">',
            'Сызықтық теңдеулер жүйесінің оң жағында белгісіз барлық коэффициенттердің квадраттарының қосындысы бірлікке тең болуы керек',
            '<img src="ans100.3.png" class="alpha">',
            'Сызықтық теңдеулер жүйесінің оң жағында белгісіз барлық коэффициенттердің квадраттарының қосындысы біреуден көп болуы керек',
        ],
        rightAnswer: 0
    },
    {
        question: 'Сызықтық теңдеулер жүйесін шешудің тікелей әдістеріне мыналар жатады',
        options: [
            'Симпсон әдісі',
            'Рунге-кутта әдісі',
            'Қарапайым итерация әдісі',
            'Ортогонализация әдісі',
            'Зейдель әдісі',
        ],
        rightAnswer: 3
    },
    {
        question: 'А матрицасының детерминанты ' + '<img src="qst102.png">',
        options: [
            '50',
            '160',
            '14',
            '-1',
            '0',
        ],
        rightAnswer: 2
    },
    {
        question: 'F(x)=0 теңдеуі алгебралық деп аталады, егер F(x) функциясы болса',
        options: [
            'k-ші еселік түбірі бар сызықтық функция',
            'Трансценденттік функция',
            'Алгебралық функция',
            'k-ші еселік функциясы',
            'Қарапайым түбір функциясы',
        ],
        rightAnswer: 2
    },
    {
        question: 'Итерациялық әдістер сызықтық теңдеулер жүйесін шешеді',
        options: [
            'Егер жүйенің теңдеулері мен айнымалыларының саны берілген мәннен аспаса',
            'Егер барлық үш метриканың конвергенциясы орындалса',
            'Егер кеңейтілген матрицаның детерминанты нөлге тең болса',
            'Бір схема бойынша есептелген дәйекті жуықтау шегі ретінде',
            'Арифметикалық амалдардың соңғы саны үшін',
        ],
        rightAnswer: 3
    },
    {
        question: 'F(x)=0 теңдеуінің түбірлерін жартылай бөлу әдісімен нақтылау нәтижесінде түбірі бар өте аз көршілестік алынды [α,β]. Сонда теңдеудің түбірі ретінде мәнді қабылдауға болады',
        options: [
            'x=(α+β)*2',
            'x=(α+β)/2',
            'x=(α-β)*2',
            'x=(α-β)/2',
            'x=2*α+2*β',
        ],
        rightAnswer: 1
    },
    {
        question: 'Функцияның туындысын табу алгоритмін бағдарламалық түрде іске асыру үшін '+ '<img src="qst106.png" class="func">' + 'x=1,7 үшін Ньютон түрінің көпмүшесіне негізделген сандық дифференциалдау әдісі таңдалды: ' + '<img src="qst106.png" class="func">' + 'Содан кейін алгоритмнің бірінші қадамында функцияны кестелік көрініске аудару керек. Осы қадамға сәйкес келетін ең дәл жауапты таңдаңыз.',
        options: [
            'x0=1,7, x1, x2, x3 және h=1 қадамдары бар функция мәндерінің кестесін құрыңыз',
            'h=x0-x1 қадамымен x0, x1, x2 түйін нүктелерінде функция мәндерінің кестесін құрыңыз',
            'x0, x1, x2, x3 тең шығатын түйіндері бар функция мәндерінің кестесін құрыңыз, мұндағы x=1,7 мәні [x0,x3] сегментіне жатады',
            'Ақырлы айырмашылықтар кестесін құру',
            'x0=1,7, x1, x2, x3, x4 тең шығатын түйіндері бар функция мәндерінің кестесін құрыңыз',
        ],
        rightAnswer: 4
    },
    {
        question: 'f(x) функциясы кесте түрінде берілген: x0=1; x1=2; x2=3; y0=4; y1=1; y2=6. Функцияның интегралын табу үшін трапеция формуласы таңдалады. Содан кейін интегралдың жуықталған мәні '+ '<img src="qst107.png" class="formula">' + 'тең',
        options: [
            '12',
            '14',
            '-6',
            '7',
            '6',
        ],
        rightAnswer: 4
    },
    {
        question: 'Аналитикалық өрнек түрінде жауап беретін дифференциалдық теңдеулерді шешу әдістері топқа жатады',
        options: [
            'Сандық әдістер',
            'Аналитикалық әдістер',
            'Графикалық әдістер',
            'Сандық саралау әдістері',
            'Сандық интеграция әдістері',
        ],
        rightAnswer: 1
    },
    {
        question: 'f(x) функциясы кесте түрінде берілген: x0=1; x1=1,5; x2=2; y0=2; y1=1; y2=6. Функцияның интегралын табу үшін трапеция формуласы қолданылады. Содан кейін интегралдың жуықталған мәні ' + '<img src="qst109.png" class="formula">' + 'тең',
        options: [
            '2,5',
            '9',
            '4,5',
            '10',
            '5',
        ],
        rightAnswer: 0
    },
    {
        question: 'Кестелік мәндермен берілген функцияның мәнін есептеу үшін Ньютонның екінші интерполяциялық формуласын практикалық қолдану кезінде (х аргументін өзгерту қадамы бірдей болған жағдайда, яғни h=const), формула бойынша есептелген t параметрін ұтымды түрде енгізіңіз',
        options: [
            '<img src="ans110.5.png" class="formula"> ',
            '<img src="ans110.1.png" class="formula"> ',
            '<img src="ans110.2.png" class="formula"> ',
            '<img src="ans110.4.png" class="formula">',
            '<img src="ans110.3.png" class="formula">',
        ],
        rightAnswer: 0
    },
    {
        question: 'Кестеде көрсетілген f(x) функциясын сандық интеграциялау процедурасын орындау үшін ' + '<img src="qst111.png" class="longf">' + 'деп аталатын формула таңдалады',
        options: [
            'Лагранж формуласы',
            'Ньютон формуласы',
            'Трапеция формуласы',
            'Симпсон формуласы',
            'Котес формуласы',
        ],
        rightAnswer: 3
    },
    {
        question: 'f(x) функциясы кесте түрінде берілген: x0=1; x1=2; x2=3; y0=4; y1=0,5; y2=6. Функцияның интегралын табу үшін Симпсон формуласы таңдалады. Содан кейін интегралдың жуықталған мәні' + '<img src="qst112.png" class="formula">' + 'тең',
        options: [
            '12',
            '6',
            '4',
            '7',
            '-4',
        ],
        rightAnswer: 2
    },
    {
        question: 'Кестеде берілген f(x) функциясының туындысын табу үшін Ньютон түрінің көпмүшесі таңдалады:' + '<img src="qst113.png" class="longf">' + 'Егер x аргументі тең болса, туынды жуықтап есептеуді орындауға болады',
        options: [
            'x=h',
            'x=x1',
            'x=x0',
            'x=x1-x0',
            'x=y0',
        ],
        rightAnswer: 2
    },
    {
        question: 'f(x) функциясы [-1,1] сегментінде x0 =-1, x1=-0,5, x2, x3, x4=1 түйіндік нүктелеріндегі мәндерімен берілген. Содан кейін екінші және үшінші түйін нүктелері сәйкесінше тең болады',
        options: [
            '0; 0,3',
            '-0,4; -0,3',
            '0,6; 0,8',
            '0; 0,5',
            '0; 0,8',
        ],
        rightAnswer: 3
    },
    {
        question: 'f(x) функциясы [0.5, 1.1] сегментінде x0 =0.5, x1=0.8, x2=1.1 түйін нүктелеріндегі мәндерімен берілген. Содан кейін интерполяция қадамы',
        options: [
            '0,1',
            '0,3',
            '-0,3',
            '0,8',
            '0,5',
        ],
        rightAnswer: 1
    },
    {
        question: 'Кестеде берілген f(x) функциясының туындысын табу үшін Ньютон түрінің көпмүшесі таңдалады: ' + '<img src="qst116.png" class="longf">' + ' Содан кейін f(x) функциясының түйіндік нүктелерінің саны',
        options: [
            '4',
            '6',
            '0',
            '2',
            '5',
        ],
        rightAnswer: 4
    },
    {
        question: 'f(x) функциясы кесте түрінде ұсынылған: (x1,y1), (x2,y2), … (xn,yn). F(x) жуықтау функциясы келесідей: ' + '<img src="qst119.png" class="formula">' + 'Есепті сандық түрде шешу үшін бастапқы функция эквивалентті түрлендірулерге ұшырайды, нәтижесінде F=a*u+b теңдігі пайда болады. Содан кейін y=f(x) функциясының кестелік мәндері алдымен түр түрлендірулеріне ұшырауы керек',
        options: [
            'u=ln(x)',
            'F=ln(y)',
            'Ф=1/y',
            'Ф=ln(y)',
            'u=1/x',
        ],
        rightAnswer: 4
    },
    {
        question: 'Ең кіші квадраттар әдісін қолдана отырып, кесте бойынша берілген f(x) функциясының жуықтау мәселесін шешу түрдің есептеу формуласына негізделген' ,
        options: [
            '<img src="ans120.1.png" class="longf">',
            '<img src="ans120.4.png" class="longf">',
            '<img src="ans120.5.png" class="longf">',
            '<img src="ans120.3.png" class="longf">',
            '<img src="ans120.2.png" class="longf">',
        ],
        rightAnswer: 1
    },
    {
        question: 'Сызықтық теңдеулер жүйесі итеративті түрге ауыстырылды: ' + '<img src="qst130.png" class="sistems">' + 'Конвергенцияны Тексеру сәтті өтті. Егер бастапқы жуықтау x1=0, x2=0, x3=0 деп қабылданса, онда екінші жуықтау болады',
        options: [
            'x1 = 0,8, x2 = -1, x3 = 1',
            'x1 = -1, x2 = 1, x3 = -1',
            'x1 = 1, x2 = -1, x3 = 1',
            'x1 = -1, x2 = 0,8, x3 = 1',
            'x1 = 1, x2 = -1, x3 = 0,8',
        ],
        rightAnswer: 0
    },
    {
        question: 'Кестеде көрсетілген f(x) функциясын сандық интеграциялау процедурасын орындау үшін' + '<img src="qst146.png" class ="longf">' + 'деп аталатын формула таңдалады',
        options: [
            'Трапеция формуласы ',
            'Ньютон формуласы',
            'Симпсон формуласы ',
            'Котес формуласы ',
            'Лагранж формуласы ',
        ],
        rightAnswer: 0
    },
];
  
numberOfAllQuestion.innerHTML = questions.length;  // выводим кол-во вопросов

const load = () => {
    question.innerHTML = questions[indexOfQuestion].question; // сам вопрос

    option1.innerHTML = questions[indexOfQuestion].options[0];
    option2.innerHTML = questions[indexOfQuestion].options[1];
    option3.innerHTML = questions[indexOfQuestion].options[2];
    option4.innerHTML = questions[indexOfQuestion].options[3];
    option5.innerHTML = questions[indexOfQuestion].options[4];

    numberOfQuestion.innerHTML = indexOfPage + 1; // устоновка номера страницы 
    indexOfPage++;
};

let comletedAnswers = [];

const randomQuestion = () => {
    let randomNumber = Math.floor(Math.random() * questions.length);
    let hitDuplicate = false;

    if(indexOfPage == questions.length) {
        quizOver();
    } else {
        if(comletedAnswers.length > 0) {
            comletedAnswers.forEach(item => {
                if(item == randomNumber) {
                    hitDuplicate = true;
                }
            });
            if(hitDuplicate) {
                randomQuestion();
            } else {
                indexOfQuestion = randomNumber;
                load();
            }
        }
        if(comletedAnswers == 0) {
            indexOfQuestion = randomNumber;
            load();
        }
    }
    comletedAnswers.push(indexOfQuestion);
};



const checkAnswer = el => {
    if(el.target.dataset.id == questions[indexOfQuestion].rightAnswer) {
        el.target.classList.add('correct');
        updateAnswerTracker('correct');
        score++;
        msgofScore();
    } else {
        el.target.classList.add('wrong');
        updateAnswerTracker('wrong');
    }
    disabledOptions();
};

const disabledOptions = () => {
    optionElements.forEach(item => {
        item.classList.add('disabled');
        if(item.dataset.id == questions[indexOfQuestion].rightAnswer) {
            item.classList.add('correct');
        }
    });
};

const enableOptions = () => {
    optionElements.forEach(item => {
        item.classList.remove('disabled', 'correct', 'wrong');
    });
};

const answerTracker = () => {
    questions.forEach(() => {
         const div = document.createElement('div');
         answersTracker.appendChild(div);
    });
};

const updateAnswerTracker = status => {
    answersTracker.children[indexOfPage - 1].classList.add(`${status}`);
};

const attModal = document.querySelector('.attention-over-modal');
const btnClosed = document.getElementById("btn-close");

btnClosed.addEventListener('click', function () {
    attModal.classList.remove('actived');
});

const validate = () => {
    if(!optionElements[0].classList.contains('disabled')) {
       attModal.classList.add('actived');
    } else {
        randomQuestion();
        enableOptions();
    }

};

btnNext.addEventListener('click', validate);

for(option of optionElements) {
    option.addEventListener('click', e => checkAnswer(e));
}

function msgofScore() {
    if(score == 0 || score == 1)  {
        msgOfResult.innerHTML = 'Cъебись с универа.';
    } 
     else if(score == 2 || score == 3) {
        msgOfResult.innerHTML = 'пиздуй учить матем и казахский';
     }
     else if(score == 4 || score == 5) {
        msgOfResult.innerHTML = 'Ну можно и лучшеее!';
     }
     else if(score == 6 || score == 7) {
        msgOfResult.innerHTML = 'А ты хорош!';
     }
     else if(score == 8 || score == 9) {
        msgOfResult.innerHTML = 'ЕМААА ТЫ МАТЕМАТИК';
     } else {
        msgOfResult.innerHTML = 'ДА ТЫ ПРЯМ КАК НЬЮТОН';
     }
}




const quizOver = () => {
    document.querySelector('.quiz-over-modal').classList.add('active');
    correctAnswer.innerHTML = score;
    numberOfAllQuestion2.innerHTML = questions.length;
    coratten();
    document.getElementById('btn-next').value= "ЗАВЕРШИТЬ";   
};

const tryAgain = () => {
    window.location.reload();
};

btnTryAgain.addEventListener('click', tryAgain);

window.addEventListener('load', () => {
    randomQuestion();
    answerTracker();
});